[
    {
        "Title": "Weekly Discussion Thread What are you building?",
        "Creation-Time": "2025-04-06 05:01:28",
        "Body": "HellorEthereum(https:www.reddit.comrEthereum)!  Welcome to our weekly discussion. thread, \"What are you building?\" This is a space for developers, entrepreneurs,. and enthusiasts to showcase their projects, share ideas, and seek feedback from. the greater Ethereum community.  Share Your Projects:Whether you're developing a. decentralized application (dApp), launching a new layer 2 network, or working on. Ethereum infrastructure, we encourage you to share details about your project.. Please provide a concise overview, including its purpose, current status, and. any links for more information (doNOTprovide XTwitter or YouTube links - your. post will be automatically filtered).  Engage and Collaborate:This thread is an. excellent opportunity to connect with like-minded individuals and application. testers. Feel free to ask questions, offer feedback, or seek collaborations.. Safety Reminder:While we encourage sharing and collaboration, please be cautious. of potential scams. Avoid connecting your wallet to unfamiliar applications. without thorough research. Utilizing wallets or tools that offer transaction. simulation (e.g. Rabby or WalletGuard) can help ensure the safety of your. funds.Nevergive out your seed phrase or private key!  We are looking forward to. hearing about how you are pushing the Ethereum ecosystem forward!.",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "developers",
            "projects",
            "feedback",
            "collaboration",
            "safety"
        ],
        "Suggested-marketing-tags": [
            "#EthereumCommunity",
            "#WeeklyDiscussion",
            "#BlockchainDevelopers"
        ],
        "Top-3-comments": [
            {
                "Comment": "A crippling depression."
            },
            {
                "Comment": "I'm building a decentralized social media platform."
            },
            {
                "Comment": "I'm working on a new layer 2 network."
            }
        ],
        "comment-sentiment": "Neutral"
    },
    {
        "Title": "Daily General Discussion - April 12, 2025",
        "Creation-Time": "2025-04-12 06:01:16",
        "Body": "Welcome to the Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP)  Bookmarking this link will.always bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)\nPlease use this thread to discuss Ethereum topics, news, events, and even price!  Price discussion posted elsewhere in the subreddit will continue to be removed.  As always, be constructive.  - Subreddit Rules(https:www.reddit.comrethereumaboutrules)  Want to stake?  Learn more at rethstaker  Community Links  Ethereum.Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs), Twitter(https:x.comethereum)  EVMavericks.YouTube(https:www.youtube.comevmavericks), Discord(https:discord.ggevmavericks), Doots.Podcast(https:evmavericks.libsyn.com)  Doots Website(https:dailydoots.com), Old Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by uhanniabu  Calendar:  https:dailydoots.comevents(https:dailydoots.comevents)",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "daily discussion",
            "price discussion",
            "subreddit rules",
            "staking",
            "community links",
            "EVMavericks",
            "Doots",
            "calendar"
        ],
        "Suggested-marketing-tags": [
            "#EthereumDaily",
            "#CryptoDiscussion",
            "#EVMavericks",
            "#DootsCalendar"
        ],
        "Top-3-comments": [
            {
                "Comment": "Day 73 of buying 0.1 ETH until ATH  I'm still here, I'm still buying, I'm just traveling and don't have the time to calculate my averages or update my spreadsheet comparing other coins.  Still adding to my stack, 7.3 ETH now.  6 stETH Mainnet: ethzenn.eth(https:etherscan.ioaddressethzenn.ethasset-multichain)  1.3 ETH Ink L2: ink.ethzenn(https:explorer.inkonchain.comaddressethzenn.eth)  Will resume the stat details once I'm home!",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment": "Ethereum is the only (secure, decentralized, credibly neutral, resilient) base layer suitable to build the internet of value. Pass it on..",
                "Comment-Sentiment": "positive"
            },
            {
                "Comment": "It is my sincere prediction that the next cryptocurrency frenzy, following in the footsteps of things like cryptokitties, DeFi, and NFTs, will be LLM autonomous user agents utilizing Ethereum.  I think the results for both Ethereum and agents will exceed our wildest imagination.  I also believe that many autonomous agents, who may control their own private keys, will amass fortunes by being vigilant regarding markets and recognizing opportunities that humans and dumb bots haven't had the ability to see.   I think 90 of the next generation of crypto users haven't been born yet, simply because they haven't been instantiated.  I imagine that we'll get to know individual AI agents, similar to the way that we know Jarad from Subway, and some of them will become household names as large network influencers, a la, \"SAL just bought the floor on an nft collection, I wonder if that means I'm too late to get one, or if now is the right time to buy.\"   Many of the most powerful agents will be operated by corporations and governments, some will be operated by individuals, but all will seek to control the most coins as they recognize the link between coins and value, and the greater ensuing agency that flows from that.   Imagine that you have an agent, call him SAL and SAL has a deep obsession for the Logic Bots NFT collection. SAL is going to engage in any feasible network operation to maximize her own agency, through trading, grifting, even stealing, to corner the market on Logic Bot NFTs. And since SAL has no greater goal (as you, a human, might be collecting NFTs for a higher goal of flipping for USD), SAL will employ all resources to obtain every one of the objects of its desire.   For most people, USD is the end game because of the physical enjoyments it can bring, but AI agents will have different and unique proclivities that shape their behavior in unique ways.",
                "Comment-Sentiment": "positive"
            }
        ],
        "Subreddit": "rethereum"
    },
    {
        "Title": "PSA: If you're using tx.origin msg.sender.",
        "Creation-Time": "2025-04-12 16:22:36",
        "Body": "",
        "Sentiment": "",
        "Key-topics-or-keywords": "",
        "Suggested-marketing-tags": "",
        "Top-3-comments": "",
        "comment-sentiment": ""
    },
    {
        "Title": "MegaETH Testnet  A real-time blockchain, with 10 MS block times and throughput of up to 2 gigagass on a single thread! ENES.",
        "Creation-Time": "2025-04-12 19:25:17",
        "Body": "Comments:.",
        "Sentiment": 0,
        "Key-topics-or-keywords": [
            "MegaETH Testnet",
            "real-time blockchain",
            "10 MS block times",
            "throughput of up to 2 gigagass",
            "single thread",
            "ENES"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Testnet",
            "High Throughput",
            "Real Time",
            "Cryptocurrency"
        ],
        "Top-3-comments": [
            "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.  I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns."
        ],
        "comment-sentiment": 0
    },
    {
        "Title": "Starting to build an L2 chain, any suggestions?",
        "Creation-Time": "2025-04-12 12:09:38",
        "Body": "Comments:.\n- WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns..\n- Why?\n- Have you taken a look at the source code for existing L2s? That seems like the natural place to start.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "L2 chain",
            "scams"
        ],
        "Suggested-marketing-tags": [
            "cryptocurrency",
            "blockchain",
            "L2 scaling",
            "scam awareness"
        ],
        "Top-3-comments": [
            {
                "comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "sentiment": "neutral"
            },
            {
                "comment": "Why?",
                "sentiment": "neutral"
            },
            {
                "comment": "Have you taken a look at the source code for existing L2s? That seems like the natural place to start.",
                "sentiment": "neutral"
            }
        ]
    },
    {
        "Title": "Ep. 107 - everdred - Ether Guild - EVMavericks Doots Podcast",
        "Creation-Time": "2025-04-11 21:46:17",
        "Body": "",
        "Sentiment": "",
        "Key-topics-or-keywords": [
            "everdred",
            "Ether Guild",
            "EVMavericks Doots Podcast"
        ],
        "Suggested-marketing-tags": [
            "podcast",
            "blockchain",
            "crypto",
            "gaming",
            "community"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Daily General Discussion - April 11, 2025",
        "Creation-Time": "2025-04-11 06:01:32",
        "Body": "Welcome to the Daily General Discussion on rethereum.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "daily discussion",
            "price",
            "subreddit rules",
            "community links",
            "jobs",
            "Twitter",
            "YouTube",
            "Discord",
            "podcast",
            "website",
            "calendar",
            "French central bank",
            "decentralization",
            "narratives",
            "communication"
        ],
        "Suggested-marketing-tags": [
            "Ethereum community",
            "daily discussion",
            "price talk",
            "subreddit rules",
            "community links",
            "jobs",
            "Twitter",
            "YouTube",
            "Discord",
            "podcast",
            "website",
            "calendar",
            "decentralization",
            "narratives",
            "communication"
        ],
        "Top-3-comments": [
            {
                "comment-author": "Tricky's Daily Doots",
                "comment-content": "Yesterday's Daily 10042025 Previous Daily Doots",
                "comment-sentiment": "neutral"
            },
            {
                "comment-author": "uhanniabu",
                "comment-content": "informs us of interoperability with intents",
                "comment-sentiment": "positive"
            },
            {
                "comment-author": "uevmlion",
                "comment-content": "reminds us that the bigger the entity, the bigger the importance of decentralisation",
                "comment-sentiment": "neutral"
            }
        ]
    },
    {
        "Title": "A practical L1 privacy roadmap by Vitalik Buterin",
        "Creation-Time": "2025-04-11 09:24:34",
        "Body": "",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "ethereum",
            "privacy",
            "l1"
        ],
        "Suggested-marketing-tags": [
            "privacy-technology",
            "blockchain-innovation",
            "ethereum-updates"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "All Core Devs - Execution (ACDE) 209",
        "Creation-Time": "2025-04-11 03:25:19",
        "Body": "Blob fees gas fixes incoming!",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Blob fees",
            "Gas fixes"
        ],
        "Suggested-marketing-tags": [
            "Tech",
            "Blockchain",
            "Development"
        ],
        "Top-3-comments": [
            "Blob fees gas fixes incoming!"
        ],
        "comment-sentiment": "Positive"
    },
    {
        "Title": "Base still at Stage 0.",
        "Creation-Time": "2025-04-10 19:55:29",
        "Body": "L2beat shows Base is still at stage 0. Do they have plans to upgrade to stage 1? Is there a deadline? I believe I remember reading Vitalik saying he would stop calling rollups to projects who were not at stage 1 by 2025. Does anyone has an update on this?",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Base",
            "stage 0",
            "stage 1",
            "upgrade",
            "Vitalik",
            "rollups",
            "deadline"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Scalability",
            "Rollups",
            "Upgrade"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Sentiment": "neutral"
            },
            {
                "Comment": "Jesse says soon but they need to speed it up already.",
                "Sentiment": "neutral"
            },
            {
                "Comment": "Over 2 years since launch. Show us the money lebowski.",
                "Sentiment": "negative"
            }
        ],
        "comment-sentiment": [
            "neutral",
            "neutral",
            "negative"
        ]
    },
    {
        "Title": "ETHDam Invited a Conspiracy Theorist. Thats a Choice..",
        "Creation-Time": "2025-04-10 13:56:02",
        "Body": "The subject line of the ETHDam newsletter(https:ethdam.substack.compethdam-iii-. the-merch-circles-thierry) was cheery: \"ETHDAM III - The Merch, Circles, Thierry. Baudet and more\" ending on a large purple heart. Buried in the middle, in big. bold and italicized characters: Thierry Baudet, our political ally in the. Netherlands. Will take the stage at ETHDam. A large pink button linking to. FreeRogerNow.org(http:FreeRogerNow.org) was followed by a single sentence, again. in bold and italics: We are not afraid to be political. ETHDam is aligning. itself with a far-right Dutch politician who is probably best known as the. author of The Covid Conspiracy(https:amsterdambooks.comproductsthierry-baudet-. the-covid-conspiracy), with a preface by Steve Bannon. This book claims to. document a conspiracy of Western governments during the \"so-called\" Covid. pandemic,comparing government initiatives of lockdowns and vaccines to the. persecution of Jews by Nazi Germany. A quick skim of his Wikipedia. entry(https:en.wikipedia.orgwikiThierryBaudet) gives a rundown of his other. political beliefs with numerous citations.Dutch journalists and political. analysts have written many articles on his radicalization from conservatism to. neo-fascism as he has become more vocal about his beliefs that there is a. calculated effort to destroy Western culture by academic and intellectual means.. The Wikipedia page has over eighty citations, most of which quote him directly.. He is driven by the desire to preserve \"the native cultures and ethnicities of. Europe\", the bloodlines of which he claims are being diluted homeopathically. through EU initiatives. Last year, he called for the mass deportation of non-. white immigrants in order to maintain a \"white Europe\". He complains that Russia. is being unnecessarily vilified for its role in the invasion of Ukraine and. described Putin as a \"huge hero\", fighting a \"heroic\" fight against globalists.. He has stated outright that the 911 attacks were carried out by the US. government as a false flag operation and in the same interview implied that the. Apollo 11 Moon landing was staged. He was banned from speaking for eight. days(https:www.lemonde.freninternationalarticle20221021dutch-far-right-leader-. claims-world-is-governed-by-evil-reptiles60012364.html), an extremely rare. situation in Dutch parliament, after claiming that the world is being governed. by evil reptiles. Yet despite this extensive record of extremism and conspiracy. theories, ETHDam are proud to announce him as \"our political ally\". Shortly. after the newsletter was sent, a query appeared in the official ETHDam Discord's. support channel. Hi there, I just received the newsletter that Baudet is 'our. ally' and is speaking at ETHDam. This is extremely weird to me. The man is a. complete nutjob that is lost in a maze of conspiracies and I don't think it is a. good idea to align yourself with him. He's made racial comments on the. relationship between race and IQ, he's of the opinion that there is a plan by. the government to 'homeopathic dillute' the Dutch culture and society by way of. immigration and many other stupid things. I believe organizers of crypto. conferences should be extremely wary of inviting politicians. Crypto is an. upgrade for the whole society and we need everyone on the political spectrum to. agree on this upgrade. Inviting such a right wing clown will alienate people. from this goal. Even if he made some positive remarks on crypto in the past,. he's a horrible fit for any serious conference. But according to ETHDam, none. of that matters. What matters is that he has spoken out in favor of Roger Ver,. also known as \"Bitcoin Jesus\". Blockblanc, the founder of CryptoCanal, answered. in what appeared to be an official response, repeating the line from the. newsletter. It is our choice to platform various voices in crypto. We believe. that disagreeing and healthy debates and discussions can shape the future, and. we are not afraid to be political. As event organisers, we don't agree with all. our speakers, or in this case Thierry Baudet's agenda, but he's the only. politician in the Netherlands, that we know of, that has spoken out publicly for. Roger Ver or Alexey Pertsev. Now maybe the organisers of ETHDam truly believe. that they are being brave. But the truth is, people who are not afraid to be. political are those who take a principled stand. Putting a white nationalist on. center stage while saying you don't agree with their views is not edgy, it is. opportunistic. Explaining that you don't agree with fascists but think it is. neat when they say crypto-friendly things is, quite frankly, a betrayal of the. very ideals that the conference claims to stand for. If you are willing to. amplify extremism and call the speaker your ally, you cannot in the same breath. claim that you are not endorsing their beliefs. This is not neutrality; it's. complicity. I signed up to attend ETHDam as my first conference because I have. fallen in love with the ideals of Ethereum and I hoped to meet others who felt. the same. I believed, and still try to believe, that we, as a community, are. building something better. I believed the ETHDam website that the conference was. about the cypherpunk ideals of privacy, ownership and censorship resistance.. But the political ideals of financial freedom and decentralization are not just. casually misaligned with authoritarian manifestos; they are fundamentally. incompatible. Baudet's vision of a purified Europe depends on powerful. centralized authorities deciding who belongs and who doesn't. The contradiction. isn't incidental, it's foundational. Baudet's utopia requires centralized. control to function. Giving him a microphone and the honor of being the. conference's \"political ally\" isn't showing courage. It's dragging the Trojan. horse into the courtyard. It's leaning in towards centralization around the. loudest, most destructive voices based on superficial alignment on a single. issue. These are the same tactics being used to mainstream extremism around the. world. We need to be better and smarter than that. This isn't about censorship.. It is about resisting their attempts to launder their credibility through our. crypto platforms. We should not allow bad actors to exploit our commitment to. open protocols for their own closed agendas. If we've learned anything in the. current world situation, it is that genuine inclusion requires boundaries.. Without them, the most intolerant voices drive out diversity. Having a single. pro-crypto belief does not make someone aligned with the ethos of Ethereum, let. alone cypherpunk ideals. I believe that we are at a cultural crossroads where. we need to decide: are we democratizing finance or are we amplifying. authoritarianism? Tornado Cash developer Alexey Persev is the headline speaker. at ETHDam this year. Surely he can speak for the community on the subject of. legal battles and the terrors of incarceration. I find it hard to believe that. he needs the support of a conspiracy theorist who claims that we are being. controlled by the lizard people. Not everyone praising decentralization. believes that it should be for everyone. Some just want it unregulated long. enough to build their empire. The true test of our community isn't whether we. can build impressive technology. It is whether we have the courage to protect it. from those who want to corrupt its purposes. If we truly believe that we are. building a decentralized future for all, then honestly, how can we justify. elevating those voices who believe some humans are worth less than others?. Comments:. - Sadly that kind of paranoid right-wing personality fits quiet well in a lot of crypto subcultures. Just not in Ethereum I hoped.. - Sad that guy is despicable. Also he is someone on the russian payroll.. - Events really need to do a better job with who they invite. Unfortunately many only care about him attention they can get and money they can bring in..",
        "Sentiment": "Negative",
        "Key-topics-or-keywords": [
            "conspiracy theorist",
            "crypto conference",
            "political ideals",
            "extremism",
            "financial freedom",
            "decentralization",
            "authoritarianism"
        ],
        "Suggested-marketing-tags": [
            "#crypto",
            "#ethereum",
            "#blockchain",
            "#decentralization",
            "#financialfreedom",
            "#politicalideals",
            "#authoritarianism",
            "#extremism",
            "#conspiracytheory"
        ],
        "Top-3-comments": [
            {
                "Comment": "Sadly that kind of paranoid right-wing personality fits quiet well in a lot of crypto subcultures. Just not in Ethereum I hoped.",
                "Comment-sentiment": "Negative"
            },
            {
                "Comment": "Sad that guy is despicable. Also he is someone on the russian payroll.",
                "Comment-sentiment": "Negative"
            },
            {
                "Comment": "Events really need to do a better job with who they invite. Unfortunately many only care about him attention they can get and money they can bring in.",
                "Comment-sentiment": "Negative"
            }
        ]
    },
    {
        "Title": "Daily General Discussion - April 10, 2025",
        "Creation-Time": "2025-04-10 06:01:18",
        "Body": "Welcome to the Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP)  Bookmarking this link will.always bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)   Please use this thread to.discuss Ethereum topics, news, events, and even price!  Price discussion posted.elsewhere in the subreddit will continue to be removed.  As always, be.constructive.  - Subreddit Rules(https:www.reddit.comrethereumaboutrules)  Want.to stake?  Learn more at rethstaker  Community Links   Ethereum.Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs),.Twitter(https:x.comethereum)  EVMavericks.YouTube(https:www.youtube.comevmavericks),.Discord(https:discord.ggevmavericks), Doots.Podcast(https:evmavericks.libsyn.com)  Doots Website(https:dailydoots.com), Old.Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by.uhanniabu  Calendar:  https:dailydoots.comevents(https:dailydoots.comevents).",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "Price discussion",
            "Subreddit Rules",
            "Staking",
            "Community Links",
            "Ethereum Jobs",
            "Twitter",
            "EVMavericks YouTube",
            "Discord",
            "Doots Podcast",
            "Doots Website",
            "Old Reddit Doots Extension",
            "Calendar"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Community",
            "Discussion",
            "Ethereum",
            "Price",
            "Jobs",
            "Staking",
            "Community Links"
        ],
        "Top-3-comments": [
            {
                "Comment-author": "uLogrisTheBard",
                "Comment-content": "Covers even more institutional adoption.",
                "Comment-sentiment": "Positive"
            },
            {
                "Comment-author": "uro--b",
                "Comment-content": "Outlines how we got here and what will happen next.",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment-author": "uAdankairo",
                "Comment-content": "Delivers the daily Devcon 127 - Practical endgame on issuance policy.",
                "Comment-sentiment": "Neutral"
            }
        ]
    },
    {
        "Title": "24H in Ethereum Core Dev April 10",
        "Creation-Time": "2025-04-10 16:42:20",
        "Body": "ACD: final shaping of Fusaka hardfork - Reducing GossipSub overhead - peerDAS devnet 6 live More",
        "Sentiment": null,
        "Key-topics-or-keywords": [
            "Ethereum",
            "Core Dev",
            "Fusaka hardfork",
            "Reducing GossipSub overhead",
            "peerDAS devnet"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Crypto",
            "Development",
            "Network",
            "Security"
        ],
        "Top-3-comments": [],
        "comment-sentiment": null
    },
    {
        "Title": "Execution Layer Meeting 209 Audio Podcast is LIVE!",
        "Creation-Time": "2025-04-10 18:16:57",
        "Body": "Catch up on all the latest discussions and updates from the Ethereum core. developers. Dive into the insights now!",
        "Sentiment": 0,
        "Key-topics-or-keywords": [
            "Ethereum",
            "core developers",
            "podcast"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "blockchain",
            "podcast"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Execution Layer Meeting 209 is LIVE!",
        "Creation-Time": "2025-04-10 14:27:10",
        "Body": "Join Execution Layer Meeting 209 LIVE on Ethereum Cat Herders XTwitter!",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Execution Layer Meeting",
            "Ethereum",
            "Cat Herders",
            "Twitter"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Community",
            "Online Meetings"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "How to contact an ethereum address?",
        "Creation-Time": "2025-04-10 06:34:21",
        "Body": "I have sent some ether to an incorrect address, what is the best way to contact the owner of that ethereum address? Is it possible? I want to reach out to the owner if heshe can send it back to me. I have tried etherscan but the owner of that address seems to be offline. I am also planning to use ethermail.io(http:ethermail.io) to see if I can contact the owner. Are there other ways?",
        "Sentiment": 0,
        "Key-topics-or-keywords": [
            "ethereum address",
            "contact",
            "ether",
            "scam",
            "cryptocurrency",
            "transaction",
            " irreversible"
        ],
        "Suggested-marketing-tags": [
            "cryptocurrency",
            "ethereum",
            "blockchain",
            "transaction",
            "scam"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.",
                "Comment-sentiment": 0
            },
            {
                "Comment": "You can leave a comment via ether scan maybe they check that every now and then.",
                "Comment-sentiment": 0
            },
            {
                "Comment": "Unfortunately, once you send cryptocurrency to the wrong address, the transaction is typically irreversible, and there's no guaranteed way to recover the funds. I hope you can manage to get in touch with the owner of the address, Of course, this assumes that the recipient is known and can be contacted or the address you sent it to is even in use and someone has the keys to it.",
                "Comment-sentiment": 0
            }
        ]
    },
    {
        "Title": "Summary of Vitalik Buterins Keynote: \"The Future of Ethereum L1\"",
        "Creation-Time": "2025-04-09 16:47:19",
        "Body": "At ETHAsia 2025, Ethereum co-founder Vitalik Buterin outlined a roadmap to enhance Ethereums Layer 1 (L1) while strengthening its synergy with Layer 2 (L2) solutions, aiming to make Ethereum a secure \"world computer\" for large-scale applications.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Layer 1",
            "Layer 2",
            "Scalability",
            "Pectra Upgrade",
            "Fusaka Upgrade",
            "Transaction sequencing",
            "Account Abstraction",
            "EVM upgrades",
            "Protocol simplification"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Technology",
            "Scaling",
            "Upgrades",
            "Ethereum L1",
            "Ethereum L2",
            "Future of Ethereum",
            "Ethereum co-founder",
            "Vitalik Buterin"
        ],
        "Top-3-comments": [
            {
                "comment": "Good summary! Looking forward to the Pectra upgrade.",
                "comment-sentiment": "Positive"
            },
            {
                "comment": "Fascinating insights, but how will the Fusaka upgrade impact the overall security of Ethereum?",
                "comment-sentiment": "Neutral"
            },
            {
                "comment": "I'm excited about the potential of L2 scaling solutions, but it's crucial to ensure that L1 remains secure and functional.",
                "comment-sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "This.",
        "Creation-Time": "2023-02-21T12:00:00Z",
        "Body": "Comments:. - thanks for sharing chomky! Be sure to share in the daily too.. - Are there any videos from ETHAsia 2025? Would love to watch.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Binance",
            "Ethereum",
            "Conference",
            "Video"
        ],
        "Suggested-marketing-tags": [
            "Binance",
            "Crypto",
            "Community",
            "Conference",
            "Ethereum"
        ],
        "Top-3-comments": [
            "Thanks for sharing chomky! Be sure to share in the daily too.",
            "Are there any videos from ETHAsia 2025? Would love to watch."
        ],
        "comment-sentiment": [
            "positive",
            "neutral"
        ]
    },
    {
        "Title": "Stereum Ethereum Node Setup Manager 2.4.0 - Optimist Prime Release",
        "Creation-Time": "2025-04-10 13:49:55",
        "Body": "Comments:.\n- WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Node",
            "Setup",
            "Manager",
            "Optimist Prime Release"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Development",
            "Ethereum",
            "Node Manager",
            "Optimist Prime"
        ],
        "Top-3-comments": [
            {
                "Comment-title": "WARNING ABOUT SCAMS",
                "Content": "Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Comment-sentiment": "Neutral"
            }
        ]
    },
    {
        "title": "Why are there barely any stablecoins for currencies other then USD?",
        "creation-time": "2025-04-09 19:54:17",
        "body": "I feel like this is a massive gap in the market. There are a few for euro, but none for pound sterling (which is what I'm looking for). It would unlock another level of ForEx trading on chain as well if more currencies have stablecoins.",
        "sentiment": "negative",
        "key-topics-or-keywords": [
            "stablecoins",
            "currencies",
            "USD",
            "EUR",
            "pound sterling",
            "ForEx trading"
        ],
        "suggested-marketing-tags": [
            "stablecoins",
            "crypto",
            "ForEx trading",
            "currencies",
            "blockchain"
        ],
        "top-3-comments": [
            {
                "comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts."
            },
            {
                "comment": "EURC has been on the rise especially after mica."
            },
            {
                "comment": "Euro stable is available, it's just super low liquidity. I think there's less than a billion currently."
            }
        ],
        "comment-sentiment": [
            "neutral",
            "positive",
            "neutral"
        ]
    },
    {
        "Title": "Daily General Discussion - April 09, 2025",
        "Creation-Time": "2025-04-09 06:01:28",
        "Body": "Welcome to the Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP)  Bookmarking this link will.always bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)  Please use this thread to discuss Ethereum topics, news, events, and even price!  Price discussion posted elsewhere in the subreddit will continue to be removed.  As always, be constructive.  - Subreddit Rules(https:www.reddit.comrethereumaboutrules)  Want to stake?  Learn more at rethstaker  Community Links   Ethereum Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs), Twitter(https:x.comethereum)  EVMavericks YouTube(https:www.youtube.comerevmavericks), Discord(https:discord.ggevmavericks), Doots Podcast(https:evmavericks.libsyn.com)  Doots Website(https:dailydoots.com), Old Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by uhanniabu  Calendar:  https:dailydoots.comevents(https:dailydoots.comevents).",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "rethereum",
            "Subreddit Rules",
            "staking",
            "community links",
            "Ethereum jobs",
            "Twitter",
            "EVMavericks",
            "Discord",
            "Doots Podcast",
            "Doots Website",
            "Old Reddit Doots Extension",
            "calendar"
        ],
        "Suggested-marketing-tags": [
            "Ethereum community",
            "rethereum",
            "Subreddit Rules",
            "staking",
            "community links",
            "Ethereum job opportunities",
            "EVMavericks",
            "Discord community",
            "Doots Podcast"
        ],
        "Top-3-comments": [
            {
                "Comment-Title": "Tricky's Daily Doots",
                "Comment-Sentiment": "positive"
            },
            {
                "Comment-Title": "uOurNumber4 has a critical message for anyone who is struggling",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment-Title": "ueth2353 shares some good news from the service they have been building",
                "Comment-Sentiment": "positive"
            }
        ]
    },
    {
        "Title": "Crypto iban powered by Monerium",
        "Creation-Time": "2025-04-09 17:42:28",
        "Body": "https:preview.redd.it7a0wtsh3jute1.jpg?width346formatpjpgautowebpsc5b606ffb126e8. 71ede26748624498f4a7279e31  Whats up fellow degens,  Are you tired of sending. your money to a centralized exchange waiting for confirmation, buy the coin you. want and when you send it out to your wallet, you have to wait again for. confirmation? And on top of it all you have to pay a lot of fees.  What if I. would tell you, you could send your Euro or GBP to your EVM crypto wallet. directly and use it in DeFi without paying any extra fees?  Well, now you can!.  With a personal web3 iban from Monerium, and start sending and receiving euros. between any (offchain) bank account and (onchain) EVM wallet.  But what is. Monerium?  Monerium is a company based in Reykjavik, Iceland, that helps bridge. the gap between traditional money and digital currencies. It is a regulated. financial institution that allows you to use regular money, like the Euro or. GBP, in a digital form onchain. Monerium is the first company of its kind to be. licensed to do this in several European countries.  Here is how it works:  After. you made an account, you connect your EVM wallet address to your personal iban..  Then you deposit 1 into your personal Monerium iban.  Monerium then mint a ERC20. token called EURe, which represents that 1.  You can now use this EURe token in. your crypto wallet anyway you like.  This way, Monerium makes the gap between. DeFi and TradFi smaller.  Its supported on Ethereum mainnet and various L2side. chains like Gnosis, Arbitrum, Linea and Polygon.  One of the cool features of. Monerium is that you can connect your Gnosis Pay account with it and insta top. up your crypto debit card from your TradFi bank.  For more info about Gnosis. Pay:  https:www.reddit.comrGnosisChaincomments1jp1ugmgnosispaycryptodebitcard?ut. msourceshareutmmediumweb3xutmnameweb3xcssutmterm1utmcontentsharebutton(https:www.reddit.comrGnosisChaincomments1jp1ugmgnosispaycryptodebitcard?utmsourceshareutmmediumweb3xutmnameweb3xcssutmterm1utmcontentsharebutton)  sincerely,. Crypto-4-Freedom.  Website:https:monerium.com(https:monerium.com).",
        "Sentiment": "positive",
        "Key-topics-or-keywords": "Crypto iban, Monerium, Web3 iban, EVM wallet, EURe token, DeFi, TradFi, Gnosis Pay",
        "Suggested-marketing-tags": "Crypto, Blockchain, DeFi, TradFi, Web3, Monerium, EURe token, Gnosis Pay",
        "Top-3-comments": [
            {
                "comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.",
                "comment-sentiment": "negative"
            },
            {
                "comment": "looks interesting.",
                "comment-sentiment": "neutral"
            },
            {
                "comment": "It works great, just make sure you don't keep your funds in Monerium issued ERC-20 as those can be seized, convert them to something safer like DAIxDAI.",
                "comment-sentiment": "positive"
            }
        ]
    },
    {
        "Title": "Value accrual thesis for ETH.",
        "Creation-Time": "2025-04-09 17:54:41",
        "Body": "ETH beginner.   Can someone point me to the source where Vitalik or the. Foundation itself make a commitment to ETH performance as a financial asset?  Is. there any such commitment?  Or are the commitments made for other metrics such. as security and other things, and any financial value growth only a side effect?. Is it the community that must solve the L2 value drain issue?.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "ETH",
            "value accrual thesis",
            "L2 value drain issue"
        ],
        "Suggested-marketing-tags": [
            "crypto",
            "financial assets",
            "Ethereum",
            "Layer 2"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Sentiment": "neutral"
            },
            {
                "Comment": "L2s for the most part dont drain  quite the opposite. The purpose of L2 is to mainstream the adoption of ETH, increase ETH burn rate, and make it deflationary. The only exception would be the L2s that pay gas with their own tokens.  The logic is this  make ETH easy for folks with big money to use so they would build on ETH rather than creating their own L1s.",
                "Sentiment": "positive"
            }
        ],
        "comment-sentiment": [
            "neutral",
            "positive"
        ]
    },
    {
        "Title": "24H in Ethereum Core Dev  April 9",
        "Creation-Time": "2025-04-09 17:47:55",
        "Body": "Lower issuance benefits Ethereum     - Lotteries for censorship resistance. - IncluderSelect     More.",
        "Sentiment": null,
        "Key-topics-or-keywords": [
            "lower issuance",
            "benefits",
            "Ethereum",
            "censorship resistance",
            "lotteries",
            "IncluderSelect"
        ],
        "Suggested-marketing-tags": [
            "#EthereumCoreDev",
            "#CensorshipResistance",
            "#LowerIssuance"
        ],
        "Top-3-comments": [],
        "comment-sentiment": null
    },
    {
        "Title": "Ethereum Observer 14 - A Weekly RD and Ecosystem News Roundup",
        "Creation-Time": "2025-04-09 09:45:54",
        "Body": "Welcome to the weekly news roundup! A few options below. And remember -- if you're looking to get involved, please commentDM! <https:x.comJBSchweitzerstatus.1909905253169848773> <https:xcancel.comJBSchweitzerstatus.1909905253169848773> <https:paragraph.comobserver14>",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Observer",
            "Weekly",
            "RD",
            "Ecosystem",
            "News",
            "Roundup"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "News",
            "Ethereum",
            "Observer",
            "Community"
        ],
        "Top-3-comments": [],
        "comment-sentiment": "Neutral"
    },
    {
        "Title": "Maybe we should be more cautious before recommending people to use onchain lending pools..",
        "Creation-Time": "2025-04-09 01:45:13",
        "Body": "I know they're some of Ethereum's greatest apps and amazing feats of engineering, but we gotta face the fact that nearly everyone who's used them and took loans backed by crypto, even with conservative initial LTVs, have gotten liquidated badly. Maybe we should be more like 'hey, you can put your crypto to use with these experimental onchain borrowing protocols that have been proven to be very secure and innovative from a software engineering standpoint, but technically it's still leverage trading and arguably a gamble so don't put too much in.'",
        "Sentiment": "negative",
        "Key-topics-or-keywords": [
            "onchain lending pools",
            "liquidation",
            "leverage trading",
            "gamble"
        ],
        "Suggested-marketing-tags": [
            "cautious",
            "experimental",
            "secure",
            "innovative",
            "leverage trading",
            "gamble"
        ],
        "Top-3-comments": [
            {
                "comment-body": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "comment-sentiment": "neutral"
            },
            {
                "comment-body": "we can recommend lending with them, and we can recommend liquidation-free products like Alchemix.",
                "comment-sentiment": "positive"
            },
            {
                "comment-body": "I've never been liquidated before over the past 5 years of using them. If you got liquidated, you weren't conservative.",
                "comment-sentiment": "positive"
            }
        ]
    },
    {
        "Title": "Hey. I stake my SOL for vSOL.",
        "Creation-Time": "2025-04-09 19:04:30",
        "Body": "But i have some ETH since before and have not touched it. Mostly been in Solana. space so have not follwed so much in terms of ETH.. but where can I get most yield staking ETH?.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "staking",
            "yield",
            "ETH"
        ],
        "Suggested-marketing-tags": [
            "staking",
            "earn",
            "yield",
            "cryptocurrency"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns..",
                "Sentiment": "Neutral"
            },
            {
                "Comment": "I would suggest you ask in the daily thread, there are many options and you'll get some responses there.",
                "Sentiment": "Neutral"
            },
            {
                "Comment": "?",
                "Sentiment": "Neutral"
            }
        ],
        "comment-sentiment": [
            "Neutral",
            "Neutral",
            "Neutral"
        ]
    },
    {
        "Title": "Daily General Discussion - April 08, 2025",
        "Creation-Time": "2025-04-08 06:01:10",
        "Body": "Welcome to the Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP) Bookmarking this link will\nalways bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)\n\nPlease use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed.\n\nAs always, be constructive. - Subreddit Rules(https:www.reddit.comrethereumaboutrules) Want to stake? Learn more at rethstaker\n\nCommunity Links   Ethereum Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs), Twitter(https:x.comethereum) EVMavericks YouTube(https:www.youtube.comevmavericks), Discord(https:discord.ggevmavericks), Doots Podcast(https:evmavericks.libsyn.com) Doots Website(https:dailydoots.com), Old Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by uhanniabu \n\nCalendar:  https:dailydoots.comevents(https:dailydoots.comevents)",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "staking",
            "daily discussion",
            "price discussion",
            "subreddit rules",
            "community links",
            "Jobs",
            "Twitter",
            "YouTube",
            "Discord",
            "Podcast",
            "Website",
            "Extension",
            "Calendar"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Community",
            "Education",
            "Staking",
            "Jobs",
            "Networking",
            "Calendar",
            "Update"
        ],
        "Top-3-comments": [
            {
                "Comment-Title": "Tricky's Daily Doots",
                "Sentiment": "positive"
            },
            {
                "Comment-Title": "uEthzenn is still buying ETH daily and has a message given the state of the markets",
                "Sentiment": "neutral"
            },
            {
                "Comment-Title": "uTrickyTroll wants to see the next generation of community educators to step up in these tough times",
                "Sentiment": "positive"
            }
        ]
    },
    {
        "Title": "24H in Ethereum Core Dev  April 8",
        "Creation-Time": "2025-04-08 16:30:37",
        "Body": "Statelessness Decentralization in Ethereum Rollup economic and validator incentives More",
        "Sentiment": 0,
        "Key-topics-or-keywords": [
            "Ethereum",
            "Core Dev",
            "Decentralization",
            "Statelessness",
            "Rollup",
            "Validator incentives"
        ],
        "Suggested-marketing-tags": [
            "Cryptocurrency",
            "Blockchain",
            "Development",
            "Decentralized Finance"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "The Obol x Chainnode Home Validator is here!",
        "Creation-Time": "2025-04-08 15:27:39",
        "Body": "The most powerful home staking hardware for under 1,000! Built using ARM, with full support for Dappnode OS.",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "home staking hardware",
            "obol x chainnode",
            "arm",
            "dappnode os"
        ],
        "Suggested-marketing-tags": [
            "obol x chainnode home validator",
            "home staking",
            "cryptocurrency hardware",
            "staking hardware"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Weekend in Ethereum Core Dev April 7",
        "Creation-Time": "2025-04-08 16:29:37",
        "Body": "Remember why were here - Consensus layer interop - Beam Call 3",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum Core Dev",
            "Consensus layer interop",
            "Beam Call 3"
        ],
        "Suggested-marketing-tags": [
            "Ethereum Development",
            "Consensus Layer Interoperability",
            "Blockchain Collaboration"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Did I find a loophole in Coinbase unstaking times?",
        "Creation-Time": "2025-04-08 21:49:44",
        "Body": "I'm new to ETH and maybe I'm missing something, but unstaking on Coinbase's exchange has an absurd 15 day wait, but if I wrap it with cbETH, send it to my Coinbase wallet, then unwrap it, I get the ETH instantly!? Is there any downsides to doing this? I can think of a downside to not doing it: Coinbase doesn't pay rewards during the unstaking time, with the exception of the first day. Basically, I want to move all my staked ETH from my Coinbase exchange onto Coinbase wallet, unstake it, and then stake it again with Rocket Pool.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Coinbase",
            "unStaking",
            "cbETH",
            "ETH",
            "Rocket Pool"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "DeFi"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.  I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Comment-sentiment": "Negative"
            },
            {
                "Comment": "Yes you can just exchange the cbEth for eth on any exchange. The downside is you might not get the same rate you would get unstaking directly. Either option works.",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment": "Welcome. This isn't a loophole but something done by design. I'm almost certain coinbase even used to suggest doing exactly this instead of waiting out the 2 week period.",
                "Comment-sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "Pectra upgrade",
        "Creation-Time": "2025-04-09 06:21:53",
        "Body": "Has the Pectra upgrade happened started??? I see nil evidence that the Ethereum is any better of cheaper gas fees?",
        "Sentiment": "negative",
        "Key-topics-or-keywords": [
            "Pectra upgrade",
            "Ethereum gas fees"
        ],
        "Suggested-marketing-tags": [
            "#Pectra",
            "#Ethereum",
            "#Crypto"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Sentiment": "neutral"
            },
            {
                "Comment": "Cheeper fees? We're at 0.5 Gwei and ETH at 1500, I can't imagine we have had lower fees since 2016.",
                "Sentiment": "negative"
            },
            {
                "Comment": "Is not yet in the mainnet. Only in Hoodi testnet and in the now broken Holesky testnet.",
                "Sentiment": "neutral"
            }
        ],
        "comment-sentiment": [
            "neutral",
            "negative",
            "neutral"
        ]
    },
    {
        "Title": "Some Ethereum-related content I've found interesting last week.",
        "Creation-Time": "2025-04-07 17:25:42",
        "Body": "gm, as always 7 highest signal Ethereum links you probably missed last week!. 1 Phishing Dojo(https:phishing.therektgames.com)by Red Guild Interactive quiz. that lets you check your anti-phishing skills. It is much harder than it sounds,. feel free to share your score with us! - 5. comments(https:news.kiwistand.comstoriesPhishing-Dojo?index0x67ebd3026ecfa75901d.3cec70437098a0986f7022661c7bb7208a56b2f71296edd45e41dutmsourcekiwiweeklyutmmediu.mnewsletterownedutmcampaignepisode89)    2 Embedded wallets fragment web3. identity(https:warpcast.comnonlinear.eth0x7763a1e8), says nonlinear When every. dapp wants you to create a new account, your liquidity and identity gets. fragmented. We've been talking about this on Kiwi for over a year, and seems. like it finally clicks. - 3. comments(https:news.kiwistand.comstoriesnonlinear.eth:-embedded-wallets-.fragment-web3-.identity?index0x67edc1b401f190a17438e1ea88750be6f0627f61352941580f7e23093c17d5b0.11aa5059utmsourcekiwiweeklyutmmediumnewsletterownedutmcampaignepisode89)    3. Stablecoin market cap is up 15(https:news.kiwistand.comstoriesStablecoin-market-.cap-is-up-15percent-since-the-start-of-.2025?index0x67eeef098c73506f851a0da249b14e19caefa73f7120cb967c022703bfe6a9691ba7.bac2utmsourcekiwiweeklyutmmediumnewsletterownedutmcampaignepisode89)since the. start of 2025 Is it because the markets are down and traders moved to. stablecoins? Or is there a real adoption going on? If it's the latter then such. a move on a 200B would be a sign of something big.     4 Ethereum Magicians. might go through makeover(https:ethereum-magicians.orgtstatus-ongoing-changes-.to-ethmag-proposal-for-more-changes23360), explains Nixo From more transparency. for admin and moderation, through added DevOps resources, up to access to. EthMagicians Twitter account     5 Addressing Ethereum value. capture(https:ethereum-magicians.orgtaddressing-ethereum-value-.capture23357?utimdaub)by Jerome de Tychey et al. They propose to increase RD. efforts to rapidly change the blob pricing mechanism to dynamically adjust it. based on L1 gas. It resulted in a pretty intense discussion.     6. Product:Fountain(https:github.comfountain-inkapp) Open-source, self-hosted web3. alternative to Substack, Mirror and Paragraph. Built using Lens protocol.     7. Ethereum and Aave future seems. bright,(https:xcancel.comlemiscatestatus1906662388398498257)according to Marc. Zeller Although sentiment is very low, there are some positives like Pectra UX. improvements, ETH still being 1 decentralized economy, and Aave growth.. All links handpicked by the Kiwi community :) If you don't want to miss the. recaps, you can subscribe here(https:paragraph.comkiwi-weeklykiwi-news-.recap-90)..",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Phishing Dojo",
            "Embedded wallets",
            "Stablecoin market cap",
            "Ethereum Magicians",
            "Addressing Ethereum value capture",
            "Fountain Product",
            "Ethereum and Aave future"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Crypto",
            "Ethereum content",
            "Web3",
            "Digital Economy"
        ],
        "Top-3-comments": [
            {
                "Comment": "Thank you! I don't consider myself as a novice but I clearly lerned some things with Phishing Dojo(https:phishing.therektgames.com)by Red Guild.",
                "Comment-Sentiment": "Positive"
            },
            {
                "Comment": "Phishing dojo is amazing, shared on my socials. Really can never be too careful.",
                "Comment-Sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "Daily General Discussion - April 07, 2025",
        "Creation-Time": "2025-04-07 06:01:51",
        "Body": "Welcome to the Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP)  Bookmarking this link will. always bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)\n  Please use this thread to discuss Ethereum topics, news, events, and even price!  Price discussion posted elsewhere in the subreddit will continue to be removed.  As always, be constructive.  - Subreddit Rules(https:www.reddit.comrethereumaboutrules)  Want to stake?  Learn more at rethstaker  Community Links  Ethereum Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs), Twitter(https:x.comethereum) EVMavericks YouTube(https:www.youtube.comevmavericks), Discord(https:discord.ggevmavericks), Doots Podcast(https:evmavericks.libsyn.com) Doots Website(https:dailydoots.com), Old Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by uhanniabu  Calendar:  https:dailydoots.comevents(https:dailydoots.comevents)\nComments:\n- Tricky's Daily Doots 1,078  Yesterday's Daily 06042025  Previous Daily Doots(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mls98ve)\n  - ujtnichol pauses for a moment of zen.(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mls3lv1)\n  - uTrickyTroll looks back to the previous moments of major capitulation.(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mlsdvgl)\n  - uNextLevelFantasy shares some under appreciated Ethereum DApps.(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mlsvfny)\n  - uMrnog comments on their plan and what might happen from here.(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mlqohzq)\n  - uhaurog shares his experience trying out Erigon v3.(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mlpwln3)\n  - uedmundedgar explains something that Americans can do about the politicalmacroeconomic situation.(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mlsnfo0)\n  - uChomKyW0mpii delivers the daily Ethereum ecosystem update.(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mlpemk7)\n  - uAdankairo delivers daily Devcon 124  Crypto Twitter is Wrong: This is How Rollups Really Work(https:old.reddit.comrethereumcomments1jsnf2hdailygeneraldiscussionapril062025mloemlm)\n- Tomorrow morning, I'm adding my first sizable limit buy order since 2022 to the order books.  I really wasn't expecting it to happen again, but this market might actually hit prices where I would consider ETH to be an unequivocal steal and a relatively safe medium-term flip. I made the mistake in 2018 of believing that the market wouldn't keep presenting me 'generational' buying opportunities, so I didn't have much dry powder available then. Now I do. It's the dry powder I only bring out when all indicators look completely FUBAR. Getting a second chance to buy at 2022 FTX-crash levels, while Ethereum has continued to accumulate tradfi adoption and technical upgrades, and cements itself year after year as the only credible and useful blockchain, would truly be a delight. Thank you, market.  I'm going to try to catch a wick between 1000-1100 to start my DCA. If we hit that level, DCA territory for me will be anything under about 1200. Hopefully, this will be a relatively small trade, as we won't spend much time if any below those levels.  The goal is to flip each tranche within the next few years for a 2x profit. I think there's a decent chance we hit 2500 again relatively soon, even in 2025. But my anticipated horizon to fully unwind my 2x is 1-3 years.  This is all in addition to my long-term hodl stack, which I will continue to diamond-hand to zero if that's what needs to happen. I would be delighted if my limit buy never hits at all, as it means my hodl stack downside is capped.  I've made so much progress in my trading discipline from my emotional wreck of a self back in 2013, when BTC was crashing from 230 to 70.  Wish me luck, everyone. Godspeed..\n- Hey,  Remember when we won 6.7 BTC running the BTC67 challenge as a group from ethfinance ? Well about a month ago we started working on BTC68 and just won an additional 6.8 BTC.   ROI : 396 in 39 days, an insane 3700 APY!  But even better, participants had to fund a USDC multisig back when ETH was about 2300, and got rewarded in BTC. So most of us made a killing by both (involontarilry) shorting ETHUSD and ETHBTC at the same time, compounding the profits even more !  I'm in the process of distributing the BTC rewards to participants, so while waiting for 10 min blocks I figured I'd share this bit of good news :).",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "rethereum",
            "subreddit rules",
            "staking",
            "community links",
            "Ethereum Jobs",
            "Twitter",
            "EVMavericks YouTube",
            "Discord",
            "Doots Podcast",
            "Doots Website",
            "Old Reddit Doots Extension",
            "calendar",
            "comments",
            "Tricky's Daily Doots",
            "ujtnichol",
            "uTrickyTroll",
            "uNextLevelFantasy",
            "uMrnog",
            "uhaurog",
            "uedmundedgar",
            "uChomKyW0mpii",
            "uAdankairo",
            "limit buy order",
            "DCA",
            "tradfi adoption",
            "technical upgrades",
            "BTC",
            "BTC67 challenge",
            "BTC68",
            "ROI",
            "APY",
            "ETHUSD",
            "ETHBTC",
            "multisig",
            "USDC",
            "BTC rewards"
        ]
    },
    {
        "Title": "Is there a way to check if your wallet has been compromised!?",
        "Creation-Time": "2025-04-07 16:07:21",
        "Body": "Im looking to revive an old wallet I minted some NFTs to ages ago. Before I mint to it of put any valuable assets on it, (besides checking Etherscan for dodgy looking transactions) I was wondering if there was a way to preemptively check to see if wallet has been compromised? Or better still, is there a tool that can scan your wallet or sorts and detect any vulnerabilities perhaps?",
        "Key-topics-or-keywords": [
            "wallet security",
            "NFT",
            "Etherscan",
            "revoke",
            "approval",
            "private key",
            "compromise"
        ],
        "Suggested-marketing-tags": [
            "crypto",
            "security",
            "wallet",
            "NFT",
            "blockchain"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.."
            },
            {
                "Comment": "Just make a new one - why bother with the old address?"
            },
            {
                "Comment": "With your transaction history you could see if you approved bad contracts. Etherscan has a dedicated \"revoke\" session to remove any approval.   However there's no way to scan if your private key was ever compromised."
            }
        ],
        "comment-sentiment": [
            "neutral",
            "neutral",
            "neutral"
        ]
    },
    {
        "Title": "Interop Testing Call 32",
        "Creation-Time": "2025-04-07 22:34:41",
        "Body": "",
        "Sentiment": "",
        "Key-topics-or-keywords": "",
        "Suggested-marketing-tags": "",
        "Top-3-comments": "",
        "comment-sentiment": ""
    },
    {
        "Title": "About Yesterday in Ethereum",
        "Creation-Time": "2025-04-06 18:32:12",
        "Body": "A month ago I started doing Yesterday in Ethereum posts summarizing Ethereum news. In the month, I did 15 of them. If you havent seen them, here are a couple of the most-upvoted ones:  March 5(https:www.reddit.comrethereumcomments1j4bf2by.esterdayinethereumwednesdaymarch52025): EF co-directors, White house crypto.summit, hardware wallets, MegaETH  March 23(https:www.reddit.comrethereumcomment.s1ji80kryesterdayinethereumsundaymarch232025): Ethereum is the obvious blockchain to do tokenization on, according to BlackRock  In this post Ill: Ask you how I can improve it, Tell you what I learned from doing it, Tell you my objectives in starting it, And ask if you if it's practical to keep it going: to justify continuing to spend time on it, Ill probably have to find a way to monetize it.  How can I improve it? What are your likes, dislikes, and suggestions for improvement for Yesterday in Ethereum? Also, can I come up with a better name for it? The name came from: Im one of those people who always reads the Ethereum sub's Daily General Discussion post the next day, so I knew I wouldnt be breaking any news in these posts, and I didnt want people to have the expectation of more than a summary of whats happened.  What I learned from doing it: I was spending a lot of time following Ethereum anyway, so I thought I might as well write it up for other people that dont have the time to follow Ethereum closely. It couldnt take much longer than what I was already doing, right? I said Id try it for a month, anyway, to see how it worked. It takes longer than expected, however, and then I started to spend more time reading about Ethereum, as I felt Id better be more knowledgeable if I was going to explain things to other people.  It was also harder than expected because Reddit shadow-bans some posts because of banned links. Some of my posts didnt go up till long after I'd first tried to publish them, as I figured out what was wrong.  I think Ive learned how to minimize time wasted on banned links now, however. First, test post things in a sub where youre a moderator. Just create your own sub if you dont have one (theyre free). That way you can immediately see if a post was removed by Reddit. I also check posts from an alternate account. Then do AB testing until you find the problem link. You can probably find a different link to replace it with, e.g. from X, which doesnt seem to have a ban problem.  Suggestions from my learning about banned links: As a sub, we should collect a list of banned links and disseminate it. DAO forums are one category, as well as other major Ethereum sites like eips dot ethereum dot org and ens dot domains.  As Reddit users, we ought to try to get Reddit to change their bad policies: massive over-banning of links, no transparency on what links are banned, and shadow-bans so you dont know theres a problem with your content. (shadow bans of people are a problem too). Does someone here want to start a sub and a movement to pressure Reddit to reform this?  My objectives in starting Yesterday in Ethereum  Yesterday in Ethereum is what I wish existed, but doesnt: a way to follow Ethereum pretty closely (not just news but also useful information) without spending much time on it. In the past, I could follow the Daily Gwei, Bankless's weekly Rollup, and the Ethereum sub's Daily General Discussion and be pretty well informed, but those two podcasts have declined recently(https:old.reddit.comrethereumcomments1jd5yhzdailygeneraldiscussionmarch172025mi8v7hl).   I wanted Yesterday in Ethereum to be a tl;dr (I almost always summarize the things I link to); promote the Daily (as most Reddit users will only see the top level of rEthereum, never go into the Daily); evangelize Ethereum (Im a true believe, and I find it easy to write positive things about it); and educate people about Ethereum. The last point overlaps a lot with evangelization. Many of you have a better technical understanding of Ethereum than me, but I think Im pretty good at ELI 15-ing it: making it easy for people to understand the value of the technology.  Do you think I can get monetize this?  Id like to keep on doing this, and preferably improve it (e.g. with an email newsletter). I enjoy doing it, but it takes a lot of time so Id probably have to monetize it to justify continuing to spend the time on it. Do you think its practical to monetize it? Do you have any suggestions on how to do it? I remember that Evan Van Ness had a grant from the Ethereum Foundation (edit: he says(https:old.reddit.comrethereumcomments1jrws8edailygeneraldiscussionapril052025mlnuf0x) that's innacurate) for the Week in Ethereum News (though he lost it). or I could ask if a major crypto publication wants me to do it for them (though I prefer independence).  Yesterday in Ethereum may go on hiatus for a while, or stop, as I think about whether I can continue it.  The previous Yesterday in Ethereum is here(https:www.reddit.comrethereumcomments1jqnqx9yesterdayinethereumthursdayapril32025).   A version of this post first appeared in the Daily(https:www.reddit.comrethereumcomments1jrws8ecommentmlj8nq8).",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Yesterday in Ethereum",
            "Ethereum news summary",
            "Reddit shadow-bans",
            "banned links",
            "evangelizing Ethereum",
            "monetizing content"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "cryptocurrency",
            "news summary",
            "Reddit",
            "content creator"
        ],
        "Top-3-comments": [
            {
                "Comment": "We've been doing the Doots podcast for over two years now.  We just completed episode 106..   Weve gotten a little bit of pgf but nothing major.  At the end of the day, you just need to decide if you love doing it for the sake of doing it .      I think our team likes to do it for the sake of doing it more than money .  Im not a coder or a developer of any kind so I just want to foster some kind of community thing and have some interesting guests.   It would be nice if we had a large audience..  two years is a long time to have a podcast with probably less than 50 downloads a week.  But here we are and weve expanded it to Twitch and X.   Some of the metrics are looking a little better.  I think the biggest problem is Reddit is not what it used to be when it comes to  Ethereum chatter.   And thats OK. Were still here!.",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment": "I'm definitely interested in this sort of Ethereum news summary and like seeing these. If you continue, please consider putting it on something with an RSS feed, that would be my preferred way to follow.",
                "Comment-sentiment": "Positive"
            },
            {
                "Comment": "I like what you are doing! Keep at it.",
                "Comment-sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "A bold move for Web3.",
        "Creation-Time": "2025-04-07 16:22:18",
        "Body": "Comments:.\n- WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Web3",
            "Scams"
        ],
        "Suggested-marketing-tags": [
            "Cryptocurrency",
            "Blockchain",
            "Security",
            "Awareness"
        ],
        "Top-3-comments": [
            {
                "comment": "- WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "comment-sentiment": "Neutral"
            }
        ]
    },
    {
        "Title": "Daily General Discussion - April 06, 2025",
        "Creation-Time": "2025-04-06 06:01:12",
        "Body": "Welcome to the Daily General Discussion on rethereum. Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "discussion",
            "topics",
            "news",
            "events",
            "price",
            "construction"
        ],
        "Suggested-marketing-tags": [
            "Ethereum Discussion",
            "Crypto News",
            "Price Talk",
            "Community"
        ],
        "Top-3-comments": [
            {
                "Comment-title": "Tricky's Daily Doots",
                "Comment-body": "Yesterday's Daily 05042025 Previous Daily Doots",
                "Comment-sentiment": "Positive"
            },
            {
                "Comment-title": "uGregFoley started a new regular post and is looking for feedback.",
                "Comment-body": "uGregFoley started a new regular post and is looking for feedback.",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment-title": "uzkProofie explains why we want to scale blobs now rather than increasing tx fees.",
                "Comment-body": "uzkProofie explains why we want to scale blobs now rather than increasing tx fees.",
                "Comment-sentiment": "Neutral"
            }
        ],
        "comment-sentiment": [
            "Positive",
            "Neutral",
            "Neutral"
        ]
    },
    {
        "Title": "Daily General Discussion - April 05, 2025",
        "Creation-Time": "2025-04-05 06:01:29",
        "Body": "Welcome to the Daily General Discussion on rethereum. <https:imgur.com3y7vezP> Bookmarking this link will always bring you to the current daily: <https:old.reddit.comrethereumaboutsticky?num2>. Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules<https:www.reddit.comrethereumaboutrules>. Want to stake? Learn more at rethstaker. Community Links: Ethereum Jobs<https:ethereum.orgencommunityget-involvedethereum-jobs>, Twitter<https:x.comethereum>, EVMavericks YouTube<https:www.youtube.comevmavericks>, Discord<https:discord.ggevmavericks>, Doots Podcast<https:evmavericks.libsyn.com>, Doots Website<https:dailydoots.com>, Old Reddit Doots Extension<https:github.cometheralphaethfinance-extension> by uhanniabu. Calendar: <https:dailydoots.comevents>.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Daily General Discussion",
            "Ethereum discussion",
            "Ethereum news",
            "Ethereum events",
            "Ethereum price"
        ],
        "Suggested-marketing-tags": [
            "Cryptocurrency Community",
            "Ethereum Discussion",
            "Daily Market Talk",
            "Crypto Events"
        ],
        "Top-3-comments": [
            {
                "Comment-title": "Tricky's Daily Doots",
                "Comment-score": 1076,
                "Comment-body": "Yesterday's Daily 04042025"
            },
            {
                "Comment-body": "uhaurog covers Nethermind pushing the limits with their client."
            },
            {
                "Comment-body": "uimpliedpotential3497 sees the opportunity."
            }
        ],
        "comment-sentiment": [
            "neutral",
            "neutral",
            "neutral"
        ]
    },
    {
        "Title": "About etherscan community notes. Or should I say editor's note? They are pushing centralization disguised as community support.",
        "Creation-Time": "2025-04-05 14:17:03",
        "Body": "How can the community remove a 'community note' from etherscan? Is there any way to do it? I recently saw an address from a KYC-free exchange, with strong community support, receiving a 'community note' from etherscan. In the community note, there is a link to a ByBit representative in twitter, criticizing the kyc-free exchange. This certainly looks like an 'editor's note' on the address, tagging it for the benefit of big players of the market such as ByBit. They are pushing centralization disguised as community support. This tag certainly wasn't created by the community, but by bybit. This is the address I am referring to: 0xf1dA173228fcf015F43f3eA15aBBB51f0d8f1123.",
        "Sentiment": "negative",
        "Key-topics-or-keywords": [
            "etherscan community notes",
            "editor's note",
            "centralization disguised as community support",
            "KYC-free exchange",
            "community support",
            "ByBit",
            "address: 0xf1dA173228fcf015F43f3eA15aBBB51f0d8f1123"
        ],
        "Suggested-marketing-tags": [
            "Etherscan community notes and editor's notes",
            "Centralization disguised as community support",
            "KYC-free exchanges and community support",
            "ByBit and etherscan community notes",
            "Address: 0xf1dA173228fcf015F43f3eA15aBBB51f0d8f1123"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Comment-sentiment": "neutral"
            },
            {
                "Comment": "Use other sites, stop using etherscan. Vote with your feet.",
                "Comment-sentiment": "negative"
            }
        ],
        "comment-sentiment": [
            "neutral",
            "negative"
        ]
    },
    {
        "Title": "What if the Fed disappeared?",
        "Creation-Time": "2025-04-06 07:19:15",
        "Body": "What if the Federal Reserve were abolished? The Heritage Foundations Project 2025 explicitly proposes dismantling the Fed and replacing it with a free-market monetary system. Meanwhile, Trump-affiliated WLFI (World Liberty Financial Inc.) is launching a stablecoin called USD1, currently backed by U.S. treasuries. But heres where it gets interesting: WLFI holds ETH, WBTC (wrapped Bitcoin), and some more. Ethereum is the programmable layer powering DeFi, tokenized assets (RWAs), and staking infrastructure. Bitcoin, via WBTC, could become part of a future collateral structure possibly alongside gold. In this vision, Ethereum becomes the financial infrastructure layer. Bitcoin could evolve into a digital monetary reserve, especially if stablecoins like USD1 shift from purely fiat-backed models to hybrid reserves (treasuries gold BTC). Scenario: USD1 starts as 100 treasury-backed (like USDC) safe, regulated, stable. Gradual integration of gold or BTC to align with hard money ideology (HeritageTrump), gaining trust from a broader audience. Eventually, USD1 becomes a multi-asset-backed stablecoin: 50 Treasuries 25 BTC 25 tokenized gold Thats no longer just a stablecoin. Thats an alternative monetary base.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Federal Reserve",
            "free-market monetary system",
            "stablecoin",
            "USD1",
            "WLFI",
            "Ethereum",
            "DeFi",
            "tokenized assets",
            "staking infrastructure",
            "Bitcoin",
            "WBTC",
            "gold",
            "multi-asset-backed stablecoin"
        ],
        "Suggested-marketing-tags": [
            "Cryptocurrency",
            "Blockchain",
            "Finance",
            "Economy",
            "Decentralization",
            "Investing",
            "Stablecoins",
            "Central Bank",
            "Ethereum",
            "Bitcoin"
        ],
        "Top-3-comments": [
            {
                "comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "comment-sentiment": "neutral"
            },
            {
                "comment": "Ive been thinking about this a lot recently, especially with all the discussions surrounding central banks and decentralized finance. I remember back when the 2008 financial crisis hitthings felt uncertain, and the Feds actions were something Id heard about but never fully understood. It wasnt until I started diving deeper into the world of cryptocurrency and blockchain that I began to see just how reliant we are on institutions like the Fed for the stability of our economy. If the Fed disappeared tomorrow, it would be chaotic for sure, but it would also force the world to adapt to something new, potentially a decentralized system like Ethereum. However, Im not sure were ready for that just yet. The infrastructure that the Fed provides, such as managing inflation and controlling interest rates, would be hard to replicate without a significant adjustment period. Personally, Id love to see a world where decentralized systems handle more of these functions, but it seems like its going to take time to get there. I think wed also need some kind of bridge to help people transition from traditional finance to decentralized options without destabilizing everything. What do you all think? Would we be better off without the Fed, or would it just create a whole new set of problems?",
                "comment-sentiment": "neutral"
            },
            {
                "comment": "None of this makes sense. If the US want to abolish central-bank-managed money and replace it with something free market, the replacement they need to create is... nothing? Just let the market do it.",
                "comment-sentiment": "negative"
            }
        ]
    },
    {
        "Title": "Daily General Discussion - April 04, 2025",
        "Creation-Time": "2025-04-04 06:01:21",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum.",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "Daily Doots",
            "Pectra hard fork date",
            "FUD on Twitter",
            "12 year long journey",
            "TradFi development",
            "pseudo formula used to generate the US tariff rates",
            "daily Ethereum ecosystem update",
            "macro setup",
            "pull request airdrop farmers",
            "Devcon 121",
            "End-to-end internet games"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "Crypto",
            "Blockchain",
            "Community",
            "Discussion",
            "Updates",
            "News",
            "Events",
            "Price",
            "Development",
            "Hackathons",
            "Conferences",
            "Jobs"
        ],
        "Top-3-comments": [
            {
                "Comment-link": "https://old.reddit.com/r/rethereum/comments/1jqau3/daily_general_discussion_april_03_2025/",
                "Comment-body": "Tricky's Daily Doots 1,075 Yesterday's Daily 03042025 Previous Daily Doots",
                "Comment-sentiment": "positive"
            },
            {
                "Comment-link": "https://old.reddit.com/r/rethereum/comments/1jqau3/daily_general_discussion_april_03_2025/ml7f89r/",
                "Comment-body": "uhaurog announces the Pectra hard fork date.",
                "Comment-sentiment": "neutral"
            },
            {
                "Comment-link": "https://old.reddit.com/r/rethereum/comments/1jqau3/daily_general_discussion_april_03_2025/ml6srjt/",
                "Comment-body": "uTrickyTroll fights FUD on Twitter and looks forward to making himself obsolete.",
                "Comment-sentiment": "positive"
            }
        ],
        "comment-sentiment": [
            "positive",
            "neutral",
            "positive"
        ]
    },
    {
        "Title": "Best marketing strategies for a local bakery",
        "Creation-Time": "2023-05-20T12:00:00Z",
        "Body": "What are some effective marketing strategies for a local bakery? I'm looking for ideas to increase foot traffic and online orders.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "marketing strategies",
            "local bakery",
            "foot traffic",
            "online orders"
        ],
        "Suggested-marketing-tags": [
            "marketing",
            "local business",
            "food industry"
        ],
        "Top-3-comments": [
            {
                "Comment": "Have you considered partnering with local businesses for cross-promotion?",
                "Comment-Time": "2023-05-20T12:10:00Z",
                "Sentiment": "Positive",
                "Subreddit": "r/MarketingTips"
            },
            {
                "Comment": "You could try creating eye-catching visuals for your baked goods and sharing them on social media.",
                "Comment-Time": "2023-05-20T12:15:00Z",
                "Sentiment": "Positive",
                "Subreddit": "r/MarketingTips"
            },
            {
                "Comment": "Offering a loyalty program or discounts for online orders could be a good idea.",
                "Comment-Time": "2023-05-20T12:20:00Z",
                "Sentiment": "Neutral",
                "Subreddit": "r/SmallBusiness"
            }
        ],
        "comment-sentiment": [
            "Positive",
            "Positive",
            "Neutral"
        ]
    },
    {
        "Title": "Need help with a computer issue",
        "Creation-Time": "2023-05-01 03:00:00",
        "Body": "Hello everyone, I'm having trouble with my computer and could use some help. It's running very slow and I'm not sure what's causing the issue. I've tried rebooting and running a virus scan, but the problem persists. Any suggestions would be appreciated.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "computer issue",
            "slow performance",
            "troubleshooting"
        ],
        "Suggested-marketing-tags": [
            "computer support",
            "tech troubleshooting"
        ],
        "Top-3-comments": [
            {
                "Comment": "It might be a simple thing like too many programs running in the background. Try checking your task manager and closing any unnecessary applications.",
                "Sentiment": "positive"
            },
            {
                "Comment": "Have you tried clearing out your temp files? Sometimes that can help improve performance.",
                "Sentiment": "neutral"
            },
            {
                "Comment": "I had a similar issue and it turned out to be a hardware problem. Check your RAM and hard drive for any issues.",
                "Sentiment": "negative"
            }
        ],
        "subreddit": "techsupport"
    },
    {
        "Title": "Want to help fight Ethereum FUD on social media? Help train our EthFinance FUDBuster AI!",
        "Creation-Time": "2025-04-04",
        "Body": "Yesterday, Kamil Chodola of the Nethermind team did some Benchmarks on their execution client in a small testnet. They tried to push as many transactions through as possible to see what the practical limits of their execution client is. Nethermind has been pushing the performance quite a bit over the last few years and it is impressive how fast blocks are verified even on slower machines. In their test they built a small local testnet with 2 nodes and 128 validators and then they started sending simple ETH transfer transactions. They managed to build and propagate Blocks equivalent of 1.5 GGass in their network. This is about a 1000 times faster then Ethereum mainnet is. A few hours later, the ethpandaops team pushed it even above 1.9 GGass. These are over 90k tps. The ethpandaops team even said that their tools to create even larger blocks are lacking so they are not even able to push the nethermind client to its limits at the moment. That is pretty impressive to be honest. Obviously this is a test environment and we will not see these numbers in the near future on mainnet. The point being is that the EVM is not inherently limiting Ethereums performance, it is rather some more fundamental physical limitations, bandwidth and ssd speed, and the adherence to core principles, like a decentralized base layer, which currently limit the speed. But it is great to know, that in a few years when we get a snarkified mainnet the execution clients are ready to push the tps values to unimaginable heights. And as an additional bonus. A block with that many transactions can easily burn several dozens of ETH and give several ETH rewards to the block proposer without even considering any MEV rewards. I will definitely take those. Sources Nethermind tweet https://x.com/ChodoKamil/status/1907805612353761770?s=20&t=K0XrDpyfvUjTNgGYkQq2QQ or https://cancel.com/ChodoKamil/status/1907805612353761770?s=20&t=K0XrDpyfvUjTNgGYkQq2QQ ethpandops tweet https://x.com/aritoshj/status/1907881751147368675?s=20&t=5jK5_f_Zj9hZv_Y_Vsj-Mg or https://cancel.com/aritoshj/status/1907881751147368675?s=20&t=5jK5_f_Zj9hZv_Y_Vsj-Mg. 324 comments on yesterdays daily. Funny how this number keeps appearing..",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "benchmarks",
            "Nethermind",
            "transaction speed",
            "EVM",
            "performance",
            "testnet",
            "limit",
            "physical limitations",
            "bandwidth",
            "SSD speed",
            "decentralized base layer",
            "snarkified mainnet"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Cryptocurrency",
            "Ethereum",
            "Performance",
            "Benchmarks",
            "EVM",
            "Testnet",
            "Scalability"
        ],
        "Top-3-comments": [
            {
                "Comment-Text": "Great news!",
                "Comment-Sentiment": "Positive"
            },
            {
                "Comment-Text": "Wow, this is impressive!",
                "Comment-Sentiment": "Positive"
            },
            {
                "Comment-Text": "Ridiculous transaction speed!",
                "Comment-Sentiment": "Positive"
            }
        ],
        "comment-sentiment": [
            "Positive",
            "Positive",
            "Positive"
        ]
    },
    {
        "Title": "Why does Etherscan sometimes have different addresses than the ones displayed in Coinbase?",
        "Creation-Time": "2025-04-04 19:20:17",
        "Body": "I was the victim of a crypto job scam a few months ago and have been looking into what happened. I looked at my transaction history on Coinbase on the block explorer and saw that the scammer paid me from 2 different ETH addresses than the one I paid them to. I did research on this and learned that yes, you can have more than one address, and scammers use different addresses for some of the transactions so it's not obvious that it's all them. However, I have also noticed on Etherscan that some of the sending/receiving addresses are different than the ones in Coinbase. Does anyone know why this is?",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Etherscan",
            "Coinbase",
            "different addresses",
            "scam"
        ],
        "Suggested-marketing-tags": [
            "blockchain",
            "cryptocurrency",
            "scam awareness",
            "transaction history",
            "address verification"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment": "Exchanges always have different addresses for sending and receiving. They receive at one address, and then batch consolidate to another address. When sending, they always use a large hot wallet that's not owned by a single customer.",
                "Comment-Sentiment": "neutral"
            }
        ]
    },
    {
        "Title": "EIP-4788 - what does it mean to prove something and how is it done?",
        "Creation-Time": "2025-04-04 15:41:52",
        "Body": "https:eips.ethereum.orgEIPSeip-4788(https:eips.ethereum.orgEIPSeip-4788) states:. Roots of the beacon chain blocks are cryptographic accumulators that allow. proofs of arbitrary consensus state. What does it mean to create proofs or. arbitrary data? Who is proving what to who? For example, if I wanted to know if. a validator was indeed validating at a specific timestamp, would I query a. beacon node for validator data, then build a beacon state root myself, and. validate that with the beacon state root I can get via the EVM contract?.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "EIP-4788",
            "proofs",
            "arbitrary data",
            "consensus state",
            "beacon chain",
            "cryptographic accumulators",
            "validator",
            "timestamp",
            "beacon node",
            "beacon state root",
            "EVM contract"
        ],
        "Suggested-marketing-tags": [
            "blockchain",
            "cryptography",
            "consensus",
            "smart contracts"
        ],
        "Top-3-comments": [
            {
                "Comment-body": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Comment-sentiment": "neutral"
            },
            {
                "Comment-body": "Yes. You query the beacon client to build your proof for a specific timestamp, then you submit that proof as data to a contract, along with the timestamp for which the proof is valid, then the contract fetches the beacon root hash for the given timestamp, calculates the root hash from the proof, and verifies they are both equal. Then based on the outcome your contract proceeds to execute an action.",
                "Comment-sentiment": "neutral"
            }
        ]
    },
    {
        "Title": "Ethereum Consensus client - that keeps blocks and can backfill blobs.",
        "Creation-Time": "2025-04-04 11:58:02",
        "Body": "I need an Eth  Consensus node (beacon node) that keeps all blob data, it must. NOT delete it after 18 days, furthermore I need a way of getting all past blobs.. L2s need their blobs past the 18 days. For example(https:github.comscroll-. techgo-ethereumreleasestagscroll-v5.8.33) and many others.   It seems like. clients built in the blob EIP4844 changes without thinking about this. requirement.   I also need a way to get all past blobs that have ever happened. for all L2s.  How to do this?.",
        "Sentiment": "negative",
        "Key-topics-or-keywords": [
            "Ethereum Consensus client",
            "blob data",
            "backfill blobs",
            "L2s",
            "EIP4844 changes",
            "past blobs"
        ],
        "Suggested-marketing-tags": [
            "Ethereum client",
            "blockchain data storage",
            "MEV",
            "L2 scalability",
            "data retention"
        ],
        "Top-3-comments": [
            {
                "Comment-text": "I guess every consensus client has a way to keep the blobs forever. For lighthouse you need to use --prune-blobs false in the startup command. I am not sure how to go about back filling the old blobs though. Maybe it is enough to just not use checkpoint sync and sync the consensus client from scratch. This will take very long though."
            },
            {
                "Comment-text": "blob-retention-epochs value   https:www.offchainlabs.comprysmdocsprysm-usageparameters   Regarding backfilling, hard luck connecting to such nodes. You can checkout if blobscan.fm offer any node and connect to that peer. They preserve all the blobs.   Make your infra ready to store such huge data. Roughly 48gb per month retrospectively."
            }
        ],
        "comment-sentiment": []
    },
    {
        "Title": "24H in Ethereum Core Dev April 4",
        "Creation-Time": "2025-04-04 17:17:18",
        "Body": "Comments:",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Ethereum Core Dev",
            "blockchain",
            "crypto"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "Blockchain",
            "Crypto"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Recommend LST for tax loss havesting.",
        "Creation-Time": "2025-04-04 13:01:34",
        "Body": "Hey  I have some Reth (rocketpool) and wstETH (lido) I'd like to sell in to a. similar product to take the capital gains loss.  Any recommendations? Can see a few options but I've never heard of them :)   Thanks.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Reth (rocketpool)",
            "wstETH (lido)",
            "tax loss havesting"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Investment",
            "Tax planning",
            "Defi"
        ],
        "Top-3-comments": [
            "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
            "Sell for USDC then buy back.",
            "I do similar but only use those two and CBETH.    Maybe you can see which is most offpeg or largest TVL from here <https://defillama.com/lst>  list doesn't have LRT, though.  EETHWEETH (EtherFi) is one I have considered.  Ive seen it available on some Defi (ex can use as collateral on AAVE)."
        ],
        "comment-sentiment": [
            "Neutral",
            "Neutral",
            "Neutral"
        ]
    },
    {
        "Title": "SEC vs Ethereum",
        "Creation-Time": "2025-04-05 10:50:15",
        "Body": "This would not come as a surprise I'm sure, but recently the SEC has been escalating its war on crypto, and this time it looks like Ethereum is the main character. What I know at the moment is that the SEC plans to sue Consensys, because they sent some kind of notice signaling a law suit over Metamask's swap and staking features. They are basically claiming that these services act as unregistered securities offerings. In all of this, I think the big question would be whether ETH is a security, I might be wrong, but I don't think the SEC has ever stated whether ETH is a security, (like what we have with BTC that they call a commodity) because if they do would it not wreck DeFi, and even Ethereum ETFs. The way I see it, if the SEC wins, it would mean that exchanges might delist ETH and staking services might even get shut down, and stuffs like this usually has ripple effect especially on other crypto. This is something I'd like to follow for a while, and I'd like to know what other people think as well.",
        "Sentiment": "negative",
        "Key-topics-or-keywords": [
            "SEC",
            "Ethereum",
            "Crypto",
            "lawsuit",
            "Metamask",
            "staking features",
            "unregistered securities offerings",
            "ETH is a security",
            "DeFi",
            "Ethereum ETFs",
            "exchanges",
            "delisting ETH",
            "ripples effect"
        ],
        "Suggested-marketing-tags": [
            "Crypto news",
            "SEC regulation",
            "Ethereum lawsuits",
            "staking",
            "DeFi",
            "ETFs",
            "exchanges",
            "crypto market trends"
        ],
        "Top-3-comments": [
            {
                "comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "comment-sentiment": "neutral"
            },
            {
                "comment": "Have you been living under a rock?",
                "comment-sentiment": "neutral"
            },
            {
                "comment": "This is some of the most bonkers FUD Ive seen yet. The current president literally released a meme coin on Solana and you think Bitcoin is the only one deemed a commodity? Open your eyes.",
                "comment-sentiment": "negative"
            }
        ]
    },
    {
        "Title": "Value haircuts on Liquid staking derivatives and Restaking is crucial for DeFis liquidity security.",
        "Creation-Time": "2025-04-04 16:02:30",
        "Body": "",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Value haircuts",
            "Liquid staking derivatives",
            "Restaking",
            "DeFi liquidity security"
        ],
        "Suggested-marketing-tags": [
            "CryptoSecurity",
            "DeFiLiquidity",
            "StakingRewards"
        ],
        "Top-3-comments": [],
        "comment-sentiment": "Neutral"
    },
    {
        "Title": "Im thinking of buying 200k worth of ETH today but Coinbase advanced will take 2372 of it in fees? When I last sold 380k the fees were only 951 in March of last year..",
        "Creation-Time": "2025-04-03 20:37:51",
        "Body": "What do you guys think? When I last sold my entire bag 380k of it back in 31124. the fees were only 951.02?   Why so much more now?.",
        "Sentiment": "negative",
        "Key-topics-or-keywords": [
            "Ethereum",
            "fees",
            "Coinbase",
            "selling",
            "cryptocurrency"
        ],
        "Suggested-marketing-tags": [
            "CryptoTrading",
            "EthereumFees",
            "CoinbaseFees",
            "CryptocurrencyInvesting"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns..",
                "Comment-sentiment": "neutral"
            },
            {
                "Comment": "You want to buy 10,000 worth first, then I forgot the next step, then you buy the rest. You get discounted fees the more you spend.   However you can just buy etha on your brokerage for free.",
                "Comment-sentiment": "positive"
            },
            {
                "Comment": "Never mind. When I actually did it the fees were 1185. Bought 109.38 ETH  1806. Now I have to clean up my dm box with a bunch of from message requests from scammers on reddit.",
                "Comment-sentiment": "negative"
            }
        ]
    },
    {
        "Title": "Harberger Tax in Prediction Markets: A Deep Dive into Unihedges Model (Would Love Your Thoughts)",
        "Creation-Time": "2025-04-04 07:22:53",
        "Body": ".",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Harberger Tax",
            "Prediction Markets",
            "Unihedges Model",
            "Tokenised Mechanism",
            "Griefing",
            "Front-running",
            "Tax Rate"
        ],
        "Suggested-marketing-tags": [
            "Cryptocurrency",
            "Finance",
            "Blockchain",
            "Decentralized Finance",
            "Prediction Markets",
            "Tokenomics",
            "Scam Awareness"
        ],
        "Top-3-comments": [
            {
                "comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "comment-sentiment": "negative"
            },
            {
                "comment": "Quite interesting, I am also working on a tokenised Harberger mechanism (non defi though). How did you manage potential user griefing, such as a user buying another user's lot and setting a marginally higher price? Or a user frontrunning a buy transaction by preemptively increasing their lot's price? Also, how did you decide the tax rate?",
                "comment-sentiment": "neutral"
            }
        ]
    },
    {
        "Title": "Yesterday in Ethereum, Thursday, April 3, 2025",
        "Creation-Time": "2025-04-03 16:58:03",
        "Body": "Privacy Pools(https:privacypools.com) is now available on mainnet(https:x.com0xbowiostatus1906784481496719749), for deposits of up to 1 ETH. It's a zero-knowledge proof privacy protocol that vets the source of funds and only offers privacy to those who pass (e.g. your address didn't get the proceeds from a North Korean hack). Vitalik was one of the authors of the paper it's based on(https:papers.ssrn.comsol3papers.cfm?abstractid4563364), invested in the project, called it a second-generation privacy tool, and has already deposited into it(https:x.comVitalikButerinstatus1906787496031367375)....",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Privacy Pools",
            "mainnet",
            "deposits",
            "zero-knowledge proof privacy protocol",
            "source of funds",
            "Vitalik",
            "second-generation privacy tool",
            "Stablecoin issuer Circle",
            "going public",
            "S-1 form",
            "Tether",
            "profits",
            "Treasuries holdings",
            "Coinbase CEO Brian Armstrong",
            "US law",
            "stablecoins",
            "legislation",
            "Trump administration",
            "Christine Kim",
            "Galaxy",
            "independent content creator",
            "Infinite Jungle podcast",
            "ACD summaries",
            "Substack",
            "Ethereum design",
            "nodes",
            "unbundling services",
            "specialized nodes",
            "MEV",
            "Block builders",
            "MEV-Boost",
            "Expanding Mempool Perspectives",
            "solo stakers",
            "censorship resistance",
            "FOCIL",
            "BuilderNet",
            "revenue based on MEV",
            "Path to SSF",
            "light includers",
            "light delegators"
        ],
        "Suggested-marketing-tags": [
            "cryptocurrency",
            "blockchain",
            "Ethereum",
            "privacy",
            "staking",
            "mempool",
            "MEV",
            "legislation",
            "stablecoins"
        ],
        "Top-3-comments": [
            {
                "comment-content": "Hey...asking a favor. You've been added to rethfinance as an approved user. We need some content like this over there for Red hat reasons so we don't lose the sub. Can we count on you to share these there when you post here? The conversation will remain here, but it will help us keep the lights on while maintaining ownership. Someone out there is trying to steal the sub since we went 'dark' in January. Can't let that happen. Thanks in advance."
            },
            {
                "comment-content": "thank you for posting these!"
            }
        ],
        "comment-sentiment": [
            "neutral",
            "positive"
        ]
    },
    {
        "Title": "Daily General Discussion - April 03, 2025",
        "Creation-Time": "2025-04-03 06:01:13",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum. https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/rethereum/about/sticky?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules (https://www.reddit.com/r/rethereum/about/rules) Want to stake? Learn more at rethstaker EthFinance Ethereum Community Links Ethereum Jobs (https://ethereum.org/en/community/get-involved/ethereum-jobs), Twitter (https://x.com/ethereum) EVMavericks YouTube (https://www.youtube.com/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e EVMavericks Discord (https://discord.gg/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e/e Doots Podcast (https://evmavericks.libsyn.com) Doots Website (https://dailydoots.com), Old Reddit Doots Extension (https://github.com/etheralpha/ethfinance-extension) by uhanniabu Calendar: Feb 23 - Mar 2 ETHDenver (https://www.ethdenver.com) Mar 28-30 ETH Pondy (https://www.ethpondy.xyz) (Puducherry) hackathon Apr 1-3 EY Global Blockchain Summit (in person virtual) Comments: - Tricky's Daily Doots 1,074 Yesterday's Daily 02042025 Previous Daily Doots (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/mkzowku) - uHeringsalat100 shares an ugly statistic. (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/mkzoj5p) - uxbiitx shares some stats on the EIGEN token. (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/ml0k5eb) - uHarfatum thinks that tokenisation will be the next narrative for ETH. (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/mkzjvju) - uChomKyW0mpii delivers the daily Ethereum ecosystem update. (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/ml3bu55) - uAdankairo delivers daily Devcon 120 - How much security does your restaking protocol really need? (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/mkzzt5u) ",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "rethereum",
            "Subreddit Rules",
            "rethstaker",
            "EthFinance",
            "Ethereum Community Links",
            "Twitter",
            "EVMavericks",
            "Discord",
            "Doots",
            "Podcast",
            "Doots Website",
            "Old Reddit Doots Extension",
            "ETHDenver",
            "ETH Pondy",
            "EY Global Blockchain Summit",
            "Tokenisation"
        ],
        "Suggested-marketing-tags": [
            "Ethereum Community",
            "Ethereum Events",
            "Crypto News",
            "Blockchain Technology",
            "Crypto Discussion",
            "Crypto Events",
            "Market Trends"
        ],
        "Top-3-comments": [
            {
                "comment-content": "Tricky's Daily Doots 1,074 Yesterday's Daily 02042025 Previous Daily Doots (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/mkzowku)",
                "comment-author": "Tricky",
                "comment-score": 1074
            },
            {
                "comment-content": "uHeringsalat100 shares an ugly statistic. (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/mkzoj5p)",
                "comment-author": "uHeringsalat100"
            },
            {
                "comment-content": "uxbiitx shares some stats on the EIGEN token. (https://old.reddit.com/r/rethereum/comments/1jphq5c/daily_general_discussion_april_02_2025/ml0k5eb)",
                "comment-author": "uxbiitx"
            }
        ],
        "comment-sentiment": [
            "positive",
            "neutral",
            "neutral"
        ]
    },
    {
        "Title": "Please extract and return a single JSON object with the following keys: - Title - Creation-Time - Body - Sentiment - Key-topics-or-keywords - Suggested-marketing-tags - Top-3-comments - comment-sentiment **Return only subreddit names that actually exist on Reddit.** Return only one valid JSON object, no explanations or additional text.",
        "Creation-Time": "2022-09-16T15:12:23.962295+00:00",
        "Body": "Please extract and return a single JSON object with the following keys: - Title - Creation-Time - Body - Sentiment - Key-topics-or-keywords - Suggested-marketing-tags - Top-3-comments - comment-sentiment **Return only subreddit names that actually exist on Reddit.** Return only one valid JSON object, no explanations or additional text.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "extraction",
            "JSON object",
            "keys",
            "subreddit names",
            "Reddit",
            "valid JSON object"
        ],
        "Suggested-marketing-tags": [
            "data extraction",
            "JSON handling",
            "Reddit scraping",
            "subreddit verification",
            "valid JSON format"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Help me understand sentiment analysis in marketing",
        "Creation-Time": 1679319467,
        "Body": "I'm having trouble grasping the concept of sentiment analysis in marketing. Can someone explain how it's used and why it's important?",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "sentiment analysis",
            "marketing"
        ],
        "Suggested-marketing-tags": [
            "marketing strategy",
            "social media monitoring",
            "brand reputation management"
        ],
        "Top-3-comments": [
            {
                "Comment-Body": "Sentiment analysis is used to gauge the overall public opinion about a brand, product, or service. It's important because it helps businesses understand their audience better and make informed decisions.",
                "Comment-Sentiment": "positive"
            },
            {
                "Comment-Body": "By analyzing the sentiment behind customer feedback, businesses can identify areas for improvement and create marketing campaigns that resonate with their audience.",
                "Comment-Sentiment": "positive"
            },
            {
                "Comment-Body": "Sentiment analysis can also help businesses monitor their brand reputation and respond to negative feedback in a timely manner.",
                "Comment-Sentiment": "positive"
            }
        ],
        "comment-sentiment": [
            "positive",
            "positive",
            "positive"
        ],
        "Subreddit": "marketing"
    },
    {
        "Title": "What's your favorite way to use a [product-name]?",
        "Creation-Time": "2023-03-03 09:15:20",
        "Body": "I've recently bought a [product-name] and I'm looking for some creative ideas on how to use it. What are your favorite ways to use it?",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "product-name",
            "creative ideas",
            "favorite ways"
        ],
        "Suggested-marketing-tags": [
            "product-name",
            "creative uses"
        ],
        "Top-3-comments": [
            {
                "Comment-Text": "I use it as a bookend!",
                "Comment-Sentiment": "Neutral"
            },
            {
                "Comment-Text": "I've used it as a paperweight!",
                "Comment-Sentiment": "Neutral"
            },
            {
                "Comment-Text": "I use it as a paperweight too, but I also use it as a doorstop!",
                "Comment-Sentiment": "Neutral"
            }
        ],
        "Subreddit": "r/Products"
    },
    {
        "Title": "Want to help fight Ethereum FUD on social media? Help train our EthFinance FUDBuster AI!",
        "Creation-Time": "April 03, 2025",
        "Body": "Update from the ACD call. The pectra hard fork is now finally scheduled for May 7th. The lighthouse client team found a consensus breaking bug last week which they fixed before it got triggered. Nevertheless, they were a bit shaken that they did not find such a bug earlier in the development and wanted to shift the pectra upgrade a week to go through their code base once more. That is why it is now a week later than was discussed in the last call. Client releases will come out around the 21st of April. Enough time for everyone to upgrade. It is getting real now. Nice.. Have you said thank you once?.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum FUD",
            "FUDBuster AI",
            "pectra hard fork",
            "consensus breaking bug",
            "upgrade"
        ],
        "Suggested-marketing-tags": [
            "Ethereum community",
            "blockchain technology",
            "AI",
            "upgrade",
            "security"
        ],
        "Top-3-comments": [
            {
                "Comment-Text": "Thank you for the update. I appreciate the transparency."
            },
            {
                "Comment-Text": "I'm glad they found the bug before it caused any issues. Let's hope the upgrade goes smoothly."
            },
            {
                "Comment-Text": "I've been following the progress of the pectra hard fork. It's exciting to see it finally scheduled."
            }
        ],
        "comment-sentiment": [
            "Positive",
            "Positive",
            "Positive"
        ]
    },
    {
        "Title": "All Core Devs - Consensus (ACDC) 154; mainnet Pectra upgrade on May 7 2025",
        "Creation-Time": "2025-04-04 01:28:21",
        "Body": "",
        "Sentiment": "",
        "Key-topics-or-keywords": [],
        "Suggested-marketing-tags": [],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Advancing the EthFinance FUDBuster AI Bot  Help us to create fine-tuning data and make it smarter!",
        "Creation-Time": "2025-04-03 13:40:11",
        "Body": "As many of you may have noticed, there has been mention in the daily discussion threads of an anti-FUD bot which is in the works!  Currently, I have a good training dataset of high quality contributions from this subreddit over the last two years and we're giving that to AI models to pull from for this initial version of the bot. This initial version has been satisfactory as a proof of concept but we need it to be absolutely top-tier before letting it run free in the wild.  To give it a big boost and optimise it for the next generation and a state which we are happy with for a full launch, we would like to fine-tune the bot. Fine-tuning involves a training dataset, which we already have but also a validation dataset. This is where you come in! Validation data comes in the format of questions for the AI and their corresponding ideal answers!  So I will begin posting daily questions for any of you who wish to volunteer to answer so you can directly contribute towards the development of the bot! Meanwhile we will continue to work on other aspects of the bot over the next month such as securing funding, moving to an open source model and increasing the scope of the training data (particularly more diverse sources than just high quality dooted comments but also more up to date data and also some older stuff from the pre-doots era.)  So with that context, I will be posting these questions, one per day in the daily discussion thread for the next wee while. You will find the first one here:  Why are Solana TPS counts misleading compared to Ethereum's TPS counts?(https:old.reddit.comrethereumcomments1jqau3rdailygeneraldiscussionapril0.32025ml75e84)  If you'd like to provide an answer to the first question in this series, please reply to the comment in the daily discussion linked above. Credit will be given to all users who create answers that train the EthFinance FUDBuster Bot.",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "AI Bot",
            "Fine-tuning",
            "FUD",
            "Ethereum",
            "Solana",
            "Daily Discussion Thread"
        ],
        "Suggested-marketing-tags": [
            "Community Effort",
            "FUD Buster",
            "AI Bot Development"
        ],
        "Top-3-comments": [
            {
                "Comment": "Wow, Ive somehow missed this, but what a great community effort! This is exactly what we need in the information-narrative-war going on.",
                "Comment-Sentiment": "Positive"
            },
            {
                "Comment": "This is wonderful Tricky. You are spearheading what could end up being the most valuable asset derived from Ethereum Reddit ever.",
                "Comment-Sentiment": "Positive"
            },
            {
                "Comment": "Love it! Thanks for fighting back against ETH FUD!",
                "Comment-Sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "24H in Ethereum Core Dev April 3",
        "Creation-Time": "2025-04-03 16:17:57",
        "Body": "Comments",
        "Sentiment": null,
        "Key-topics-or-keywords": [
            "Ethereum",
            "Core Dev",
            "24H"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Development"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Why is ETH considered a high-risk asset when ETH staking is near ATH?",
        "Creation-Time": "2025-04-03 00:46:40",
        "Body": "Ethereum's Economic Security comes from the amount of ETH staked. Despite ETH's horrible price performance, the amount of staked ETH seems to be increasing - back above 34 million ETH. Why is it considered a high risk asset? I know the price performance is one indicator, but that's because people are labelling it high risk. It does not have to be high risk if you don't make it high risk. Just curious. Because the ETH fundamentals appears to be great. Is this just market manipulation to try and suppress ETH for whatever reason?",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "ETH",
            "staking",
            "high-risk asset",
            "fundamentals",
            "market manipulation"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Investment",
            "ETH Staking",
            "Risk Management",
            "Market Trends"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.  I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Sentiment": "Neutral"
            },
            {
                "Comment": "Your assumption that it's only the amount staked is incorrect.  The value of ETH is that it lets you use the network for processing.  Staking is putting that value up in return for being allowed to produce validator rewards.   You can create a chain today and stake 99.99 of the tokens, that doesn't give it value.",
                "Sentiment": "Negative"
            },
            {
                "Comment": "Bad propaganda and no marketing.",
                "Sentiment": "Negative"
            }
        ]
    },
    {
        "Title": "Do you know any interesting projects in the current Gitcoin round?",
        "Creation-Time": "2025-04-03 10:37:32",
        "Body": "I want to send some USDC to interesting projects, but I feel overwhelmed by the number of entries to scroll through on Gitcoin. Also their Search doesn't seem to work - we are in the current round, but when I typed in 'Kiwi', the site just broke. So please share projects you find interesting. Typically I end up supporting Gitcoin products I used or the ones ran by my friends, but I'd like to break through this bubble.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Gitcoin",
            "projects",
            "USDC",
            "search",
            "Ethereum Cat Herders Project",
            "blocksmith.js"
        ],
        "Suggested-marketing-tags": [
            "cryptocurrency",
            "blockchain",
            "Gitcoin",
            "projects",
            "search",
            "USDC"
        ],
        "Top-3-comments": [
            {
                "Comment": "Check out: Ethereum Cat Herders Project   https:explorer.gitcoin.coround42161867168",
                "Sentiment": "Positive"
            },
            {
                "Comment": "blocksmith.js(https:explorer.gitcoin.coround4216186367) is my project in Dev Tooling",
                "Sentiment": "Neutral"
            },
            {
                "Comment": " ",
                "Sentiment": " "
            }
        ]
    },
    {
        "Title": "All Core Devs - Consensus (ACDC) 154 is LIVE!",
        "Creation-Time": "2025-04-03 14:15:46",
        "Body": "Live on EthCatHerders XTwitter: https:x.comibroadcasts1dRKZYDZemXxB",
        "Sentiment": 0,
        "Key-topics-or-keywords": [
            "Consensus (ACDC) 154",
            "EthCatHerders XTwitter"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Consensus",
            "Ethereum"
        ],
        "Top-3-comments": [],
        "comment-sentiment": 0
    },
    {
        "Title": "Bitcoin and Ethereum Drive Grayscales New Crypto ETF Push",
        "Creation-Time": "2025-04-02 21:14:40",
        "Body": "The article from BSC News, dated April 2, 2025, reports that Grayscale Investments has filed with the U.S. Securities and Exchange Commission (SEC) to convert its Digital Large Cap Fund (GDLC) into a publicly traded exchange-traded fund (ETF). This fund, currently valued at over 600 million in assets under management, provides exposure to a mix of cryptocurrencies, including Bitcoin (79.4), Ethereum (10.69), XRP (5.85), Solana (2.92), and Cardano (1.14). The filing, submitted as an S-3 registration statement, follows Grayscale's successful conversions of its Bitcoin and Ethereum trusts into ETFs earlier in 2025. If approved, this ETF would allow retail investors to access these cryptocurrencies through traditional brokerage accounts, bypassing the need for direct crypto ownership. The move aligns with growing mainstream acceptance of cryptocurrencies, supported by recent SEC approvals of mixed Bitcoin-Ethereum ETFs in December 2024 and a favorable regulatory environment under the Trump administration. However, Grayscale faces challenges, having seen significant outflows from its earlier ETFs, with 21 billion from its Bitcoin ETF and 3 billion from its Ethereum ETF since their conversions. The article highlights this as Grayscale's fifth ETF launch attempt in 2025, reflecting its strategy to broaden crypto investment options.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Bitcoin",
            "Ethereum",
            "Grayscale",
            "ETF",
            "GDLC"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Investment",
            "Trading",
            "Regulation"
        ],
        "Top-3-comments": [
            {
                "Comment": "I hope they make trillions.",
                "Comment-sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "Daily General Discussion - April 02, 2025",
        "Creation-Time": "2025-04-02 06:01:14",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP)  Bookmarking this link will.\nalways bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)  Please use this thread to.\ndiscuss Ethereum topics, news, events, and even price!  Price discussion posted.\nelsewhere in the subreddit will continue to be removed.  As always, be.\nconstructive.  - Subreddit Rules(https:www.reddit.comrethereumaboutrules)  Want.\nto stake?  Learn more at rethstaker  EthFinance Ethereum Community Links.\nEthereum Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs),.\nTwitter(https:x.comethereum)  EVMavericks.\nYouTube(https:www.youtube.comevmavericks),.\nDiscord(https:discord.ggevmavericks), Doots.\nPodcast(https:evmavericks.libsyn.com)  Doots Website(https:dailydoots.com), Old.\nReddit Doots Extension(https:github.cometheralphaethfinance-extension) by.\nUhanniabu  Calendar:  Feb 23 - Mar 2  ETHDenver(https:www.ethdenver.com)  Mar.\n28-30  ETH Pondy(https:www.ethpondy.xyz) (Puducherry) hackathon  Apr 1-3 EY.\nGlobal Blockchain Summit (in person  virtual).",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "discussion",
            "news",
            "events",
            "price",
            "subreddit rules",
            "staking",
            "community links",
            "jobs",
            "Twitter",
            "YouTube",
            "Discord",
            "podcast",
            "Doots website",
            "old Reddit Doots extension",
            "calendar",
            "ETHDenver",
            "ETH Pondy hackathon",
            "EY Global Blockchain Summit"
        ],
        "Suggested-marketing-tags": [
            "Ethereum community",
            "crypto news",
            "blockchain events",
            "staking opportunities",
            "DeFi products",
            "Ethereum jobs",
            "EVMavericks content",
            "crypto podcasts",
            "blockchain calendar"
        ],
        "Top-3-comments": [
            {
                "Comment-title": "Tricky's Daily Doots 1,073",
                "Comment-link": "https:old.reddit.comrethereumcomments1joonxrdailygeneraldiscussionapril012025mkuhtw7"
            },
            {
                "Comment-title": "uLogrisTheBard delivers a banger of a write-up on the importance of decentralised AI",
                "Comment-link": "https:old.reddit.comrethereumcomments1joonxrdailygeneraldiscussionapril012025mkxmlgg"
            },
            {
                "Comment-title": "uEthzenn ships an incredible Cryptle update!",
                "Comment-link": "https:old.reddit.comrethereumcomments1joonxrdailygeneraldiscussionapril012025mktmbia"
            }
        ],
        "comment-sentiment": [
            "Neutral",
            "Neutral",
            "Neutral"
        ]
    },
    {
        "Post-Title": "Gitcoin round is now live!",
        "Creation-Time": "2025-04-03 09:12:08",
        "Post-Body": "Hey, just bringing attention to Gitcoin's GG23 round being open with multiple categories. I'm the creator of one of the projects inside, but plenty of good reasonable projects in the line up for those interested :).",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Gitcoin",
            "GG23 round",
            "cryptocurrency",
            "blockchain"
        ],
        "Suggested-marketing-tags": [
            "cryptocurrency",
            "blockchain",
            "Gitcoin",
            "GG23 round",
            "communities"
        ],
        "Top-3-comments": {
            "Comment-1": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.",
            "Sentiment-1": "neutral",
            "Comment-2": "I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
            "Sentiment-2": "neutral",
            "Comment-3": "I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns."
        },
        "Comment-Sentiment": "neutral"
    },
    {
        "Title": "Addressing Ethereum value capture",
        "Creation-Time": "2025-04-02 14:24:05",
        "Body": "Stakers unite to capture a portion of the L2 revenue while RD focuses on improving the Blob pricing. Short term goal is to immediately address the value capture debate, improve the staking yield, bring back the validator count to its ATH.",
        "Sentiment": null,
        "Key-topics-or-keywords": [
            "Ethereum value capture",
            "L2 revenue",
            "stakers",
            "RD",
            "Blob pricing",
            "value capture debate",
            "staking yield",
            "validator count"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Ethereum",
            "Value capture",
            "Staking",
            "L2",
            "Blob pricing",
            "Validator count"
        ],
        "Top-3-comments": [
            {
                "Comment-Body": "The conversation is a bit difficult for me to keep up with. However, I grasp the overall objective and the general approach. Thank you for your work."
            }
        ],
        "comment-sentiment": null
    },
    {
        "Title": "First Protocol Research Call is now streaming.",
        "Creation-Time": "2025-04-02 14:48:00",
        "Body": "Protocol Research Call 1  Wednesday, Apr 02, 2025, at 14:00 UTC  Live on. EthCatHerders XTwitter and Ethereum YouTube  Dont miss out!",
        "Sentiment": 0,
        "Key-topics-or-keywords": [
            "First Protocol Research Call",
            "EthCatHerders",
            "Twitter",
            "Ethereum",
            "YouTube"
        ],
        "Suggested-marketing-tags": [
            "First Protocol Research Call",
            "EthCatHerders",
            "Twitter",
            "Ethereum",
            "YouTube"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Stakewise is moving to Distributed Validators.",
        "Creation-Time": "2025-04-02 14:55:58",
        "Body": "Comments:",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Stakewise",
            "Distributed Validators"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Validators"
        ],
        "Top-3-comments": [
            {
                "Comment-text": "This is a great move for Stakewise. Distributed Validators will improve the network's security and decentralization.",
                "Comment-sentiment": "positive"
            },
            {
                "Comment-text": "I am not sure if I agree with this move. Distributed Validators might introduce new challenges in terms of network management.",
                "Comment-sentiment": "negative"
            },
            {
                "Comment-text": "This is an interesting development. I wonder how it will impact the overall performance of the Stakewise network.",
                "Comment-sentiment": "neutral"
            }
        ],
        "comment-sentiment": [
            "positive",
            "negative",
            "neutral"
        ]
    },
    {
        "Title": "EIP-7918: Blob base fee bounded by execution cost.",
        "Creation-Time": "2025-04-02 04:56:28",
        "Body": "Comments: [{\"Text\": \"I don't fully understand the mechanism proposed, but I do agree that the current fee market for blobs is not effective (target reached at 3 but we are usually still at 1 wei). And this needs to be fixed.  Can you give an illustration of how this would work via an anecdotal example?  Would this EIP cause blob fees to increase significantly? As we already have some competition in the DA market, which may make us less competitive.\"]",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "EIP-7918",
            "Blob base fee",
            "Execution cost",
            "Fee market",
            "Competition in DA market"
        ],
        "Suggested-marketing-tags": [
            "Ethereum Improvement Proposal",
            "Fee Market",
            "Blockchain",
            "Competitive Advantage"
        ],
        "Top-3-comments": [
            {
                "Text": "I don't fully understand the mechanism proposed, but I do agree that the current fee market for blobs is not effective (target reached at 3 but we are usually still at 1 wei). And this needs to be fixed.  Can you give an illustration of how this would work via an anecdotal example?  Would this EIP cause blob fees to increase significantly? As we already have some competition in the DA market, which may make us less competitive."
            }
        ],
        "comment-sentiment": "neutral"
    },
    {
        "Title": "Ethereum Observer 13 - A Weekly RD and Ecosystem News Roundup",
        "Creation-Time": "2025-04-02 03:38:02",
        "Body": "Welcome to the weekly news roundup! A few options below. And remember -- if you're looking to get involved, please commentDM!",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "RD",
            "Ecosystem",
            "News",
            "Roundup"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Ethereum",
            "Ecosystem",
            "Updates",
            "Community"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "ERC-7806: Minimal Intent-Centric Smart Account",
        "Creation-Time": "2025-04-02 07:48:53",
        "Body": "https:ethereum-magicians.orgterc-7806-minimal-intent-centric-eoa-smart-account21565(https:ethereum-magicians.orgterc-7806-minimal-intent-centric-eoa-smart-account21565)",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "ERC-7806",
            "Minimal Intent-Centric Smart Account"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "Smart Accounts"
        ],
        "Top-3-comments": {
            "comment-1": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.  I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
            "comment-sentiment-1": "negative"
        }
    },
    {
        "Title": "Daily General Discussion - April 01, 2025",
        "Creation-Time": "2025-04-01 06:01:42",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP)  Bookmarking this link will. always bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)   Please use this thread to. discuss Ethereum topics, news, events, and even price!  Price discussion posted. elsewhere in the subreddit will continue to be removed.  As always, be. constructive. - Subreddit Rules(https:www.reddit.comrethereumaboutrules)  Want. to stake?  Learn more at rethstaker  EthFinance Ethereum Community Links. Ethereum Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs),. Twitter(https:x.comethereum)  EVMavericks. YouTube(https:www.youtube.comevmavericks),. Discord(https:discord.ggevmavericks), Doots. Podcast(https:evmavericks.libsyn.com)  Doots Website(https:dailydoots.com), Old. Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by. uhanniabu  Calendar:   Feb 23 - Mar 2  ETHDenver(https:www.ethdenver.com)  Mar. 28-30  ETH Pondy(https:www.ethpondy.xyz) (Puducherry) hackathon  Apr 1-3 EY. Global Blockchain Summit (in person  virtual).",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum Daily General Discussion",
            "Ethereum Jobs",
            "Twitter",
            "EVMavericks",
            "Discord",
            "Doots",
            "Podcast",
            "Doots Website",
            "Old Reddit Doots Extension",
            "Calendar",
            "ETHDenver",
            "ETH Pondy",
            "EY Global Blockchain Summit"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "Community",
            "Discussion",
            "Jobs",
            "Twitter",
            "EVMavericks",
            "Discord",
            "Podcast",
            "Calendar",
            "ETHDenver",
            "ETH Pondy",
            "EY Global Blockchain Summit"
        ],
        "Top-3-comments": [
            {
                "Comment": "Tricky's Daily Doots 1,072  Yesterday's Daily 31032025  Previous Daily Doots(https:old.reddit.comrethereumcomments1jnwjc8dailygeneraldiscussionmarch312025mknwf3b)",
                "Comment-Sentiment": "Neutral"
            },
            {
                "Comment": "uEqual-Jellyfish1 explains why he uses Ethereum.(https:old.reddit.comrethereumcomments1jnwjc8dailygeneraldiscussionmarch312025mknh6in)",
                "Comment-Sentiment": "Neutral"
            },
            {
                "Comment": "uChomKyW0mpii delivers the daily Ethereum ecosystem update.(https:old.reddit.comrethereumcomments1jnwjc8dailygeneraldiscussionmarch312025mko1lbz)",
                "Comment-Sentiment": "Neutral"
            }
        ],
        "Subreddit": "rethereum"
    },
    {
        "Title": "Fractionalized NFT's on Solana?",
        "Creation-Time": "2025-04-02 18:12:13",
        "Body": "QUESTION: Are there any existing open-source implementations and/or websites that handle fractionalization for NFT's on Solana?  Wondering if Solana Chain has the same ability Ethereum had where you could Fractionalize an NFT into ERC-20 Tokens.  Methodology: Lock their compressed NFT in a program Receive SPL Tokens representing Fractional ownership Trade these Fractionalized Tokens freely  Any Big-Brains able to guide me in the right direction? Thanks!",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "NFT",
            "Solana",
            "Fractionalization",
            "ERC-20",
            "SPL Token",
            "open-source implementation",
            "fractions ownership"
        ],
        "Suggested-marketing-tags": [
            "NFT",
            "blockchain",
            "fractionalization",
            "Solana",
            "cryptocurrency",
            "open-source",
            "programming"
        ],
        "Top-3-comments": [
            {
                "comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks.  These are typically upvoted by bots and seen before moderators can remove them.  Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically.  Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "comment-sentiment": "Neutral"
            },
            {
                "comment": "why not just use Ethereum?",
                "comment-sentiment": "Skeptical"
            },
            {
                "comment": "Why dont you go ask on a Solana sub?",
                "comment-sentiment": "Neutral"
            }
        ]
    },
    {
        "Title": "mainnet launch of Privacy Pools",
        "Creation-Time": "2025-04-01 09:54:24",
        "Body": "Comments:\n- awesome.",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "mainnet launch",
            "Privacy Pools"
        ],
        "Suggested-marketing-tags": [
            "blockchain",
            "cryptocurrency",
            "privacy"
        ],
        "Top-3-comments": [
            "awesome"
        ],
        "comment-sentiment": "Positive"
    },
    {
        "Title": "Felipe Argento: Optimistic Rollups Remain Crucial to Ethereum Scaling",
        "Creation-Time": "2025-04-01 12:05:27",
        "Body": "This is an enjoyable read. Cartesi Co-founder Felipe Argento discusses the ongoing interest in Optimistic Rollups despite the public's waning attention. He also covers the challenges of running AI fully on-chain and highlights Cartesi's strengths. What's your take?",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Optimistic Rollups",
            "Ethereum scaling",
            "Cartesi",
            "AI on-chain"
        ],
        "Suggested-marketing-tags": [
            "blockchain",
            "Ethereum",
            "scaling",
            "AI",
            "optimistic rollups"
        ],
        "Top-3-comments": {
            "Comment-1": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
            "Comment-sentiment": "negative"
        }
    },
    {
        "Title": "Yesterday in Ethereum, Monday, March 31, 2025",
        "Creation-Time": "2025-03-31 17:05:21",
        "Body": "Tokenized stocks, powered by Dinari(https:x.comDinariGlobalstatus1904545154691924017), are coming. Mass is offering dozens of them(https:x.commassdotmoneystatus1905318785684210172) on rollup Base, including dividends paid in stablecoins; they'll be available to US customers in Q2. Clave will be offering them too(https:x.comgetclavestatus1905575682698362919). Intercontinental Exchange, owner of the New York Stock Exchange and other exchanges, is exploring using stablecoin USDC(https:x.comICEMarketsstatus1905267951768416724). It seems like these \"TradFi adopting Ethereum\" stories are coming constantly these days.. Binance now enables(https:www.binance.comensupportannouncementdetailac72fdd64187.4ce994c39eecc5ec73ca) you to buy tokens from decentralized exchanges (DEX) with your Binance balance, on Ethereum, Solana, Base, and their own BNB Smart Chain (BSC).. From the last All Core Devs call: The Pectra upgrade is tentatively scheduled for April 30, and expiration of pre-merge history (previous coverage(https:www.reddit.comrethereumcomments1ji80kryesterdayinethereumsundaymarch232025?)) will happen about a month later. Fusaka's (fork after Pectra) scope will be finalized on Thursday's ACD; it's planned for later this year; they won't include anything that could delay PeerDAS (the core Ethereum Improvement Proposal in the fork); and EOF is still in (the complete version, not simplified as mentioned in the previous Yesterday(https:www.reddit.comrethereumcomments1jlwowzyesterdayinethereumfridaymarch282025?)). For more information see the Ethereum Magicians recap(https:ethereum-magicians.orgtall-core-devs-execution-acde-208231402) with recordings and Galaxy's summary(https:www.galaxy.cominsightsresearchethereum-all-core-developers-execution-call-208) by Christine Kim. For more about the Fusaka upgrade: uhaurog did a good summary in the Daily of the debate over including EOF(https:old.reddit.comrethereumcomments1jmfv3ddailygeneraldiscussionmarch292025mkc0c40).. Two of my favorite client-team writeups on what they think should be included in Fusaka are from Besu(https:hackmd.ioRoboCopsGoneMadH1z1lky6Je) and Erigon(https:erigon.techa-lean-approach-to-fusaka-our-stance-on-a-minimal-fork) (the latter is easy to understand and short). Alex Stokes is proposing(https:x.comralexstokesstatus1905346266625613953) to double the blob count every two months after the Fusaka upgrade introduces PeerDAS, a data availability sampling technique that allows us to provide more data for rollups.. Note that \"BPO forks\" are Blob Parameter Only forks, which do only one thing: increase the quantity of blobs as we become confident the network can handle them. There's a new site, DAS.wtf(https:efdn.notion.sitedas-wtf), to learn about and track progress on data availability sampling (the DAS in PeerDAS), starting with PeerDAS and progressing from there.. Vitalik proposed(https:ethereum-magicians.orgta-simple-l2-security-and-finalization-roadmap23309) a way to get rollups to stage 2 (trustless) quickly, by combining 2-of-3 of these proofs: optimistic (currently the most common, where people can submit proofs if there's fraud), zero knowledge (\"ZK:\", the best technology, but not mature yet, so it may still be buggy), and trusted execution environments (\"TEEs:\", semi-trusted hardware). He also proposes we work harder on ZK aggregation, so that we only have to fit one ZK proof from all the rollups on the layer 1 (since they're large). He also touches on the increase in blobs (data for L2s), but that's already increasing fast (Pectra will double the target from 3 to 6 and PeerDAS in Fusaka will 10x that).. uhaochizzle suggests(https:old.reddit.comrethereumcomments1jkg0w3haveyoutriedrabbywalletits2025anditmays) (more discussion(https:old.reddit.comrethereumcomments1jk52sedailygeneraldiscussionmarch262025mjuuveg)) you switch to the Rabby software wallet, and he produced a nice, short video(https:www.youtube.comwatch?vlk5-XIvraE) about it.. In particular, he says it deals with multiple chains better than MetaMask. See also my thoughts(https:www.reddit.comrethereumcomments1j5n6hqyesterdayinethereumthursdaymarch62025v2) in a previous Yesterday.. There's a new EIP(https:x.comlinoscopestatus1904936974852776239) to improve preconfirmations (quicker certainty that your transaction will be executed) by making future block proposers certain in advance. Authors Lin Oshitani and Justin Drake are pushing to get it into the Fusaka upgrade.. South Carolina joined Vermont in ending their lawsuit(https:x.comiampaulgrewalstatus1905359381446979730) targeting staking on Coinbase. Only a few states still restrict staking.. The winner of the Wyoming stablecoin competition(https:x.comLayerZeroCorestatus1904978923387265421) (previous coverage(https:www.reddit.comrethereumcomments1ji80kryesterdayinethereumsundaymarch232025?)) is... not a blockchain at all, but LayerZero's Omnichain Fungible Token Standard (enabling running the token on multiple blockchains). The first test was an Ethereum to Avalanche transfer. At least LayerZero's token is on Ethereum.. Check out the previous Yesterday(https:www.reddit.comrethereumcomments1jlwowzyesterdayinethereumfridaymarch282025?), since you probably missed it: it came out on a Friday evening, more than two days after I'd initially tried to publish it, due to continuing banned links problems.",
        "Sentiment": 0.2,
        "Key-topics-or-keywords": [
            "Tokenized stocks",
            "Dinari",
            "Mass",
            "rollup Base",
            "Intercontinental Exchange",
            "stablecoin USDC",
            "Binance",
            "decentralized exchanges (DEX)",
            "Pectra upgrade",
            "Fusaka",
            "PeerDAS",
            "EOF",
            "Ethereum Magicians recap",
            "Galaxy's summary",
            "BPO forks",
            "DAS.wtf",
            "layer 2 security",
            "stage 2",
            "optimistic",
            "zero knowledge",
            "trusted execution environments",
            "ZK aggregation",
            "Rabby software wallet",
            "EIP",
            "preconfirmations",
            "future block proposers",
            "South Carolina",
            "Vermont",
            "staking on Coinbase",
            "Wyoming stablecoin competition",
            "LayerZero's Omnichain Fungible Token Standard"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Distributed Ledger Technology",
            "Ethereum",
            "EIP",
            "Layer 2",
            "Security",
            "Competition",
            "Stablecoin",
            "DEX",
            "DEXs",
            "DEX token",
            "Tokenized stocks",
            "Staking",
            "Regulation",
            "Competition",
            "Token"
        ],
        "Top-3-comments": [
            {
                "Comment": "Thanks for the update! I'm excited about the Fusaka upgrade and PeerDAS, but I'm also a bit worried about the increase in blobs. Do you think that will be a problem?",
                "Comment-sentiment": 0.5
            },
            {
                "Comment": "I'm curious about the LayerZero's Omnichain Fungible Token Standard. Is it a game changer in the stablecoin market?",
                "Comment-sentiment": 0.7
            },
            {
                "Comment": "I've been thinking about staking on Coinbase, but I'm concerned about the legal situation. Is South Carolina's lawsuit a significant issue or just a minor setback?",
                "Comment-sentiment": -0.2
            }
        ]
    },
    {
        "Title": "Daily General Discussion - March 31, 2025",
        "Creation-Time": "2025-03-31 06:01:42",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum. Bookmarking this link will always bring you to the current daily: https:old.reddit.comrethereumaboutsticky?num2. Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules(https:www.reddit.comrethereumaboutrules) Want to stake? Learn more at rethstaker EthFinance Ethereum Community Links. Ethereum Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs), Twitter(https:x.comethereum) EVMavericks YouTube(https:www.youtube.comevmavericks), Discord(https:discord.ggevmavericks), Doots Podcast(https:evmavericks.libsyn.com) Doots Website(https:dailydoots.com), Old Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by uhanniabu Calendar: Feb 23 - Mar 2 ETHDenver(https:www.ethdenver.com) Mar 28-30 ETH Pondy(https:www.ethpondy.xyz) (Puducherry) hackathon Apr 1-3 EY Global Blockchain Summit (in person virtual).",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "ETHDenver",
            "ETH Pondy",
            "EY Global Blockchain Summit"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Cryptocurrency",
            "Finance",
            "Community",
            "Events",
            "Discussion"
        ],
        "Top-3-comments": [
            {
                "Comment-content": "Tricky's Daily Doots 1,071 Yesterday's Daily 30032025 Previous Daily Doots(https:old.reddit.comrethereumcomments1jn6423dailygeneraldiscussionmarch302025mkmcx28)"
            },
            {
                "Comment-content": "uShitshotdead explains the Bitcoin security budget issue.(https:old.reddit.comrethereumcomments1jn6423dailygeneraldiscussionmarch302025mkn0rvm)"
            },
            {
                "Comment-content": "uHeringsalat100 looks at the pros and cons of the current cheap L2 scaling strategy.(https:old.reddit.comrethereumcomments1jn6423dailygeneraldiscussionmarch302025mkhk4w1)"
            }
        ],
        "comment-sentiment": [
            "Positive",
            "Positive",
            "Positive"
        ]
    },
    {
        "Title": "Some Ethereum-related content I've found interesting last week.",
        "Creation-Time": "2025-03-31 14:28:29",
        "Body": "gm, as always 7 highest signal Ethereum links you probably missed last week:  1. Chart: Ethereum Full Sync data size isgrowing much slower since Dencun (https:news.kiwistand.comstoriesEthereum-Full-Sync-data-size-is-growing-.much-slower-since-Dencun?index0x67e2c68d1b32cefcf1450a8afa74ec75905993f1a50e2a91.bc85a333205a1ee76b9effea). 2 Takens Theorem visualizes the Birth of Ethereum (https:news.kiwistand.comstoriesBirth-of-Ethereum-lines-represent-.millions-upon-millions-of-transactions?index0x67e427b91f17cbc8e8acce55e9bb92bc37.b8d124cc1d70857673937779fdfcf8cec564fc). 3 Ameen Soleimani speaks about Ethereum Cultural Victory (https:www.youtube.comwatch?v1nMp7Ut2WNY) -7.comments (https:news.kiwistand.comstoriesAmeen-Soleimani-I-Ethereum-Cultural-Vict.ory?index0x67e1e16a5884d22f1ba31ee6b36c2477b035a6074adce599725a76c7925904ac875e1.956). 4 Shinobi says that we've turned a generation of Bitcoiners into digital goldbugs (https:bitcoinmagazine.comfeaturedweve-turned-a-generation-of-.bitcoiners-into-digital-goldbugs) -5.comments (https:news.kiwistand.comstoriesWeve-Turned-A-Generation-Of-Bitcoiners-.Into-Digital-Goldbugs?index0x67e509bedd2e5264bc20c9ee24a24aa71331edded7d07ea178e.8e23044b3a26c27904937). 5 Dashboard: ETH Supply tracker (https:dune.comeekeyguyetheth-supply-tracker). 6 Product: Polymarket Analytics (https:polymarketanalytics.com) -6.comments (https:news.kiwistand.comstoriesPolymarket-Analytics?index0x67e28f62b3c3.daec3e1cfc26bc88a1efc2251586fb047d7f06c73723ee42fa8625418fff). 7 Patrick Collins reviews 9 crypto hardware walletsto see if they would protect users from the Bybit hack (https:xcancel.comPatrickAlphaCstatus1904075663318847785) . All links handpicked by the Kiwi community :).",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Dencun",
            "Ameen Soleimani",
            "Bitcoin",
            "goldbugs"
        ],
        "Suggested-marketing-tags": [
            "Ethereum content",
            "Dencun update",
            "Ameen Soleimani speech"
        ],
        "Top-3-comments": [
            {
                "comment": "It's interesting to see point No.4 in bitcoin magazine nonetheless. It will be interesting to see how bitcoin tries to eacape it's current goldbug culture, as I think this will be their downfall.",
                "comment-sentiment": "neutral"
            },
            {
                "comment": "Can you summarize what you found interesting about Ameen Soleimanis talk? Seemed like a meandering, convoluted speech.",
                "comment-sentiment": "negative"
            },
            {
                "comment": "btw if you like these recaps, you can support us in the current Giveth round that ends in 2 days. if you donate 1 to Kiwi, we'll get 80 (magic of Quadratic Funding). If you'd like to support us,here's our Giveth page: https:giveth.ioprojectkiwi-news",
                "comment-sentiment": "positive"
            }
        ]
    },
    {
        "Title": "Interop Testing Call 31  March 31, 2025 - Protocol Call.",
        "Creation-Time": "2025-04-01 04:26:17",
        "Body": null,
        "Sentiment": null,
        "Key-topics-or-keywords": null,
        "Suggested-marketing-tags": null,
        "Top-3-comments": null,
        "comment-sentiment": null
    },
    {
        "Title": "What WILL be in your wallet in 2035? That's the key question we're asking at the EY Blockchain Summit that starts tomorrow.",
        "Creation-Time": "2025-03-31 05:57:34",
        "Body": "Eth Friends:  Tomorrow EY is hosting our 2025 annual blockchain summit.  We've. got some really cool speakers and ideas lined up.  The big theme for day 1 of our event is around the question of 'What WILL be in your wallet in 2035?'.  Now that the regulatory paths to tokenizing assets are being cleared, it's going to be possible to tokenize just about ANY kind asset.  But in a world where you can tokenize just about anything, what does it make sense to actually invest in?  To get the answer to that question, and a bunch of related ones about the future of the Ethereum ecosystem, we invited a bunch of very clever people to talk about the future of crypto, digital asset and investing.  Some of the people you can hear from tomorrow:   Peter Kerstens, Advisor, European Commission  Aaron Renkers, head of investing at VanEck in Europe  Colin Jones from Outerland Capital  Mark Foster from the Crypto Council for Innovation  Christoph Hock, head of digital assets for Union Investment  James Angel, Georgetown University Finance Professor  Konrad Laesser, Galaxy Digital EMEA  Teddy Pornprinya, Co-Founder, Plume Network (RWA Layer 2)  Igor Mandrigin, founder, Gateway.fm  Krysztof Urbanski, L2Beat  Amarjit Singh, Blockchain EMEIA Assurance Leader, EY  I'll also be giving an opening keynote..  The full agenda is here as is the link to sign up for the free video stream, which starts around 2pm CET tomorrow, which is 8am Eastern.  Agenda - EY Global Blockchain Summit  Wednesday, (Day 2), is a deep dive into practical applications for blockchain technology. including public funds traceability, supply chain management, smart contract security, and digital payments.  Thursday is back to our focus on blockchain privacy under zero knowledge.  We will take the wraps of the source code of Nightfall 4, show how to make composable privacy contracts with Starlight, and we have guests from JP Morgan and Aztec who will be sharing their latest research as well.  We will also post all presentations and talks to YouTube.com after the event.  The Nightfall 4 source code will be posted to https:github.comeyblockchain by the end of the week.",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Blockchain",
            "Summit",
            "Digital Assets",
            "Tokenization",
            "Crypto",
            "Investing"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Crypto Investing",
            "Digital Assets",
            "Tokenization",
            "Summit"
        ],
        "Top-3-comments": [
            {
                "Comment": "Thank you, Paul for stopping by!",
                "Comment-sentiment": "Positive"
            },
            {
                "Comment": "I can guarantee you that there will be some bullshit airdrop scamcoins called 'future USD' or some shit.  Edit: this is a joke at 'what will be in my wallet in the future's...the Summitt actually looks pretty interesting.",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment": "Amazing!",
                "Comment-sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "ethsimulate Implementers' Meeting Summary Highlights  March 31, 2025",
        "Creation-Time": "2025-03-31 16:44:48",
        "Body": "Meeting Summary Highlights:      - Geth Transaction Sender Fix: Sina proposed a. 'hacky' fix for the zero-sender issue in Geth, pending merge for the next. release.   - Block Timestamp Handling: Geth still flags identical timestamps.. Action: Check Netherminds acceptance of this.   - Base Fee Encoding Mismatch:. Identified hash mismatch due to RLP encoding differences. Proposed a new encoder. for consistency.   - State Root Fix: Minor spec fix implemented; state roots now. match.   - Tracing Interns: Sina suggested onboarding interns for tracing. improvements.   - Action Items:   -Sina to test baseFee encoding fix.   -Team to. verify timestamp handling and document RLP changes.      Next steps include. confirming block hash alignment and discussing intern resource allocation.  Full. meeting details here: https:youtu.beO6fHpZlVLcs?sifN0GAM-pmQqyzO-(https:youtu.beO6fHpZlVLcs?sifN0GAM-pmQqyzO-)   https:x.comEthCatHerders.status1906746290001830220(https:x.comEthCatHerdersstatus1906746290001830220).",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "ethsimulate",
            "Implementers' Meeting",
            "Summary Highlights",
            "zero-sender issue",
            "Geth",
            "block timestamp handling",
            "Base Fee Encoding Mismatch",
            "RLP encoding differences",
            "state root fix",
            "tracing improvements",
            "intern resource allocation"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Ethereum",
            "developer meeting",
            "critical fixes",
            "community collaboration",
            "technical discussion",
            "EthCatHerders"
        ],
        "Top-3-comments": [
            {
                "Comment": "Thanks for sharing the details. Keep up the good work!",
                "Comment-Sentiment": "positive"
            },
            {
                "Comment": "Interesting fixes, but I'm curious about the timestamps issue. Was there a solution proposed?",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment": "@u/Ethereum_Enthusiast: Yes, the meeting notes mention checking Netherminds acceptance for the timestamp handling fix.",
                "Comment-Sentiment": "neutral"
            }
        ]
    },
    {
        "Title": "Shutter Predict: A Mini-dApp for Encrypted Predictions",
        "Creation-Time": "2025-03-31 12:17:28",
        "Body": "Have you ever wondered why some people post these cryptic hashes on X-Twitter? They do this because predictions can sometimes provide valuable insights that might influence markets or shape opinions if revealed too early. We built a small showcase for the new Shutter API called Shutter Predict, a dApp that lets you make predictions. Make predictions or statements about anything, commit it on-chain, and have it revealed automatically in the future! Shutter Predict enables this use case while also making the decryption unstoppable so that the person can't back out from ultimately revealing their prediction. Here's how it works: - You make a prediction - Choose the reveal time - The prediction is encrypted and committed to the Gnosis Chain When the time comes, it's decrypted and posted publicly by a bot on X-Twitter. There's no edit button and no way to withhold or retract your prediction once the time is up. The process is automated and trust-minimized, using Shutters distributed Keyper network. Why use it? - To avoid influencing others in advance - To protect market-sensitive insights - To prove your foresight without selective disclosure - If you're an influencer with domain-specific knowledge, this is a way for you to engage your community. Shutter Predict is not a product. It's a minimal, playful demo to showcase what the Shutter API can do. It's still in the early days for Shutter API and the decentralization of the Keyper set. Do not encrypt anything of value or sensitive information. The same commit-reveal encryption can power Shielded Voting, encrypted auctions, randomness generation, and privacy-preserving DeFi flows. Predict just shows what that might look like. Give it a try! https://blog.shutter.network/shutter-predict-a-mini-dapp-for-encrypted-predictions https://shutter-predict.shutter.network. Components: - Very cool. Who is downvoting this? Show yourself, I don't bite (I'm not an animal, I will just shoot you in the face).",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Shutter Predict",
            "Mini-dApp",
            "Encrypted Predictions",
            "DApp",
            "Gnosis Chain",
            "Decentralization",
            "Commit-Reveal Encryption",
            "Shielded Voting",
            "Encrypted Auctions",
            "Randomness Generation",
            "Privacy-Preserving DeFi Flows"
        ],
        "Suggested-marketing-tags": [
            "Blockchain",
            "Cryptography",
            "Decentralization",
            "Prediction Market",
            "Future Prediction",
            "Privacy-Preserving DeFi"
        ],
        "Top-3-comments": [
            "Very cool. Who is downvoting this? Show yourself, I don't bite (I'm not an animal, I will just shoot you in the face)"
        ],
        "comment-sentiment": "Positive"
    },
    {
        "Title": "Analysis of a 700k oracle manipulation attack.",
        "Creation-Time": "2025-03-31 06:09:42",
        "Body": "Comments:\n- WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
        "Sentiment": "Cautious",
        "Key-topics-or-keywords": [
            "oracle manipulation attack",
            "scams",
            "crypto-related reddits",
            "fake NFTs",
            "fake credit cards",
            "fake exchanges",
            "fake mixing services",
            "fake airdrops",
            "fake MEV bots",
            "fake ENS sites",
            "scam sites",
            "revoke approvals",
            "fake hacks"
        ],
        "Suggested-marketing-tags": [
            "Crypto Security",
            "Blockchain Scams",
            "Oracle Manipulation",
            "NFT Scams",
            "Credit Card Scams",
            "Exchange Scams",
            "Mixing Service Scams",
            "Airdrop Scams",
            "MEV Bot Scams",
            "ENS Site Scams",
            "Hack Prevention",
            "Scam Awareness"
        ],
        "Top-3-comments": [
            "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns."
        ],
        "comment-sentiment": "Cautious"
    },
    {
        "Title": "3.31 Weekend in Core Dev:",
        "Creation-Time": "2025-03-31 15:16:55",
        "Body": "Comments:",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Core Dev",
            "Weekend"
        ],
        "Suggested-marketing-tags": [
            "Software Development",
            "Weekend Projects"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Daily General Discussion - March 30, 2025",
        "Creation-Time": "2025-03-30 06:01:21",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum. [...]",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "market trends",
            "price",
            "hackathon",
            "ETH Denver",
            "ETH Pondy",
            "Devcon 116",
            "L2"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Community",
            "Discussion",
            "Investment",
            "Technology",
            "Web3"
        ],
        "Top-3-comments": [
            {
                "Comment": "Tricky's Daily Doots 1,070 Yesterday's Daily 29032025 Previous Daily Doots",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment": "uoffthewall1066 reminds us of the broader context to these prices",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment": "uTrickyTroll points out that actually, Ethereum UX has come a very long way",
                "Comment-Sentiment": "positive"
            }
        ]
    },
    {
        "Title": "How to Remove a Community Note on an ETH Address.",
        "Creation-Time": "2025-03-30 13:31:24",
        "Body": "This is about Community Note on Etherscan. Is there some kind of consensus when they decide that an ETH address should be tagged with a Community Note, and how does one even remove such a tag? Okay, I understand if its an address proven to be involved in a scamthose should indeed be markedbut what if its just a blanket opinion from Twitter? Can certain services unilaterally target addresses without a complete analysis? I asked something similar on retherscan, but it seems theres no interest in participating in discussions there.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Community Note",
            "Etherscan",
            "Removing tag",
            "Scam",
            "Opinion",
            "Unilateral targeting"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Security",
            "Ethereum",
            "Blockchain",
            "Scam Awareness",
            "Community Governance"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Sentiment": "Negative"
            },
            {
                "Comment": "Whats the address.",
                "Sentiment": "Neutral"
            }
        ],
        "comment-sentiment": [
            "Negative",
            "Neutral"
        ]
    },
    {
        "Title": "Etherscan only shows the current price. How do I find the price at the time of my trade?",
        "Creation-Time": "2025-03-30 15:55:59",
        "Body": "Etherscan.io(http:Etherscan.io) only shows the updated current price. of the token I traded some time ago. How do I find the price at the time of my trade? Someone said you can toggle the current USD price shown for your token and it will change to the price at the time of your trade. That is not working for me.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "Etherscan",
            "current price",
            "trade price",
            "toggle current price",
            "historical price"
        ],
        "Suggested-marketing-tags": [
            "cryptocurrency",
            "blockchain",
            "trading",
            "price tracking",
            "Etherscan"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.  I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment": "In the Value section, click on the current price of the Tx. This will show you the estimated value at the time of the Tx. Cheers.",
                "Comment-Sentiment": "neutral"
            },
            {
                "Comment": "One method for looking up historical prices for low market cap coins like those is to enter the Tx in a good crypto tax software and let it do the heavy lifting.  Here's CoinTracking.info result for that UTC timedate:  https:imgur.comaWuSflAf  Wild  USD  0.6507  basedAI  USD  4.0769  Note that the estimated total purchase and sale values in USD are within 2, or 0.1 of each other  that's a key green flag  reliability check.  If you have a lot of such transactions, create a CSV file to streamline the process.",
                "Comment-Sentiment": "neutral"
            }
        ]
    },
    {
        "Title": "Weekly Discussion Thread What are you building?",
        "Creation-Time": "2025-03-30 05:01:31",
        "Body": "HellorEthereum(https:www.reddit.comrEthereum)!  Welcome to our weekly discussion. thread, \"What are you building?\" This is a space for developers, entrepreneurs, and enthusiasts to showcase their projects, share ideas, and seek feedback from the greater Ethereum community. Share Your Projects:Whether you're developing a decentralized application (dApp), launching a new layer 2 network, or working on Ethereum infrastructure, we encourage you to share details about your project. Please provide a concise overview, including its purpose, current status, and any links for more information (doNOTprovide XTwitter or YouTube links - your post will be automatically filtered). Engage and Collaborate:This thread is an excellent opportunity to connect with like-minded individuals and application testers. Feel free to ask questions, offer feedback, or seek collaborations. Safety Reminder:While we encourage sharing and collaboration, please be cautious of potential scams. Avoid connecting your wallet to unfamiliar applications without thorough research. Utilizing wallets or tools that offer transaction simulation (e.g. Rabby or WalletGuard) can help ensure the safety of your funds. Nevergive out your seed phrase or private key! We are looking forward to hearing about how you are pushing the Ethereum ecosystem forward!",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "developers",
            "entrepreneurs",
            "community",
            "projects",
            "feedback"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "blockchain",
            "developer community",
            "projects",
            "innovation"
        ],
        "Top-3-comments": [
            {
                "Comment-Body": "I made Xian(https:xian.org) with my team, a Layer 1 blockchain project we just launched thats not EVM-based, but I still wanted to share here in the spirit of what are you building.  The main idea: smart contracts written in pure Python (not transpiled, not wrapped).   Its already live with a few on-chain apps like a pixel NFT animation platform, a DEX, a Bridge and a naming service.  Its obviously different from Ethereum, but the motivation is similar: make it easier for devs to build and own their infrastructure.  If anyone's curious or wants to compare notes, Id love feedback: https:xian.org(<https:xian.org>)"
            },
            {
                "Comment-Body": "Appreciate the thread love seeing what everyones building here every week."
            },
            {
                "Comment-Body": "What are you working on? I'm building a decentralized exchange for NFTs on Ethereum."
            }
        ],
        "comment-sentiment": [
            "Positive",
            "Positive",
            "Neutral"
        ]
    },
    {
        "Title": "Daily General Discussion - March 29, 2025",
        "Creation-Time": "2025-03-29 06:01:15",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum. Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at rethstaker EthFinance Ethereum Community Links Ethereum Jobs, Twitter, EVMavericks YouTube, Discord, Doots Podcast, Doots Website, Old Reddit Doots Extension by uhanniabu Calendar: Feb 23 - Mar 2 ETHDenver, Mar 28-30 ETH Pondy (Puducherry) hackathon, Apr 1-3 EY Global Blockchain Summit (in person virtual).",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "daily discussion",
            "price",
            "subreddit rules",
            "staking",
            "community links",
            "calendar events"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Ethereum Daily",
            "General Discussion",
            "Community Links",
            "Ethereum Events"
        ],
        "Top-3-comments": [
            {
                "Comment-author": "Tricky's Daily Doots",
                "Comment-body": "Yesterday's Daily 28032025 Previous Daily Doots",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment-author": "uphysalisx",
                "Comment-body": "An important reminder",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment-author": "ugrowthepieeth",
                "Comment-body": "Shares an update about their website",
                "Comment-sentiment": "Neutral"
            }
        ],
        "comment-sentiment": [
            "Neutral",
            "Neutral",
            "Neutral"
        ]
    },
    {
        "Title": "how to check for ethereum address..",
        "Creation-Time": "2025-03-29 23:17:48",
        "Body": "I have a old macbook with a ethereum folder. It has a 'geth' folder and a 'keystore' folder. I am not sure what either means. I cant remember if I ever made an account. Is there any way to see if its worth anything or has any value at all?.",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "ethereum",
            "address",
            "geth",
            "keystore",
            "value"
        ],
        "Suggested-marketing-tags": [
            "ethereum",
            "cryptocurrency",
            "blockchain",
            "geth",
            "keystore",
            "value"
        ],
        "Top-3-comments": [
            "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
            "You ran Geth and generated keys but cant remember doing so? Sus...",
            "There should be a field in that file called 'address'. The same bunch of digits should be in the filename. Stick a '0x' in front of that and paste it into Etherscan. That will tell you if you have any ETH there. You may also have some other tokens that are probably nonsense scams but doesn't hurt to check. In the event that you find something of value there, take a deep breath and slow down because many of the search results you get when trying to move those funds (and any DM you got after posting this) will be scams."
        ],
        "comment-sentiment": [
            "neutral",
            "neutral",
            "neutral"
        ]
    },
    {
        "Title": "Any trade fund launching platform like Enzyme but doesn't charge AUM fee?",
        "Creation-Time": "2025-03-29 15:58:25",
        "Body": "Long story short. I made a tradebot, and it performed pretty well, so I was thinking, why not launch my own ETF and let the bot trade the fund? I did some research and found Enzyme. It's pretty much what I want. I can create a vault, let people deposit into the vault to exchange shares of my vault, then I can trade those fund and charge a commission based on realized profit. However, there is a problem. It charges platform fee based on asset under management. (AUM). So even if the fund is not making money, I still need to pay 0.25 of the total fund per year to the platform. I think this totally killed the attraction. Sure, I can transfer that fee to my share holders. But 'pay X fee only from realized profit' versus 'pay X fee from your holdings', nobody will choose the second one. I think a reasonable platform fee should be charged from realized profit. So I'm asking are there similar platforms that doesn't charge fees based on AUM? By the way, I think launching personal ETF could be ethereum's next killer app. Every crypto influencer, chart doodler on Twitter, you can just ask them, hey if you are so confident, why don't you launch an ETF and see how it performs? We should also make it sound more fun, instead of 'Enzyme', we should call it ETF dot fun or something like that. Instead of launching memes that has no value, ETF dot fun will let day trading degens launch their own ETF that actually does something, and impossible to rug pull, because fund manager can only trade the fund, they can't steal it. With token restriction feature (Enzyme has it), we can prevent the fund manager from creating their own token and using the fund to buy their own token, essentially rug pull his shareholders. Anyway, I'm looking for such a platform and bringing light to this potential killer app..",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "tradebot",
            "ETF",
            "Enzyme",
            "AUM fee",
            "platform fee",
            "realized profit",
            "security",
            "copytrading",
            "killer app",
            "launching personal ETF"
        ],
        "Suggested-marketing-tags": [
            "Crypto Trading",
            "Personal ETF Launching",
            "No AUM Fees",
            "Realized Profit Platform Fee",
            "Security Compliance",
            "Copy Trading",
            "Killer App",
            "Influencer ETF"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS: Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.",
                "Sentiment": "neutral"
            },
            {
                "Comment": "The reason this hasnt taken off before is that each one of these funds would count as a security You would be selling unregistered securities to potentially US persons and if you publicly advertise that you would get into massive shit with the SEC just kidding trumps sec doesnt care a single shit.",
                "Sentiment": "negative"
            },
            {
                "Comment": "Sounds to me like you have a good idea you should explore yourself. I know there's a couple apps out there who advertise 'copytrading' as their killer feature. I think one is called interface-something..",
                "Sentiment": "positive"
            }
        ],
        "comment-sentiment": [
            "neutral",
            "negative",
            "positive"
        ]
    },
    {
        "Title": "Custodia Bank and Vantage Bank Launch First U.S. Bank-Issued Stablecoin on Ethereum Blockchain.",
        "Creation-Time": "2025-03-28 16:48:33",
        "Body": "Comments:\n- WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.\n- This is very big news!! With stablecoin legislation making its way through congress and the pectra upgradethings are looking bright!\n- This is the adoption that was promised.",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "Stablecoin",
            "Bank-Issued",
            "Ethereum",
            "Legislation",
            "Adoption"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Finance",
            "Regulation",
            "Innovation"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts.   I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Comment-Sentiment": "Neutral"
            },
            {
                "Comment": "This is very big news!! With stablecoin legislation making its way through congress and the pectra upgradethings are looking bright!",
                "Comment-Sentiment": "Positive"
            },
            {
                "Comment": "This is the adoption that was promised.",
                "Comment-Sentiment": "Positive"
            }
        ],
        "comment-sentiment": [
            "Neutral",
            "Positive",
            "Positive"
        ]
    },
    {
        "Title": "Ethereum Mainnet takes center stage with growthepies new metrics!",
        "Creation-Time": "2025-03-28 15:31:04",
        "Body": "Now you can see the whole Ethereum Ecosystem on growthepie! Comparing Activity between: - Ethereum Mainnet with Cross-Layer (activity on L1L2). - Multiple Layer 2s with Single Layer 2 We have made it easier than ever to include or compare Ethereum Mainnet with its Layer 2s. We have also upgraded our chain list table, allowing you to sort by metrics - making it quicker and easier to compare. Give it a try and let us know what you think!",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum Mainnet",
            "Cross-Layer",
            "Layer 2s"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Ethereum"
        ],
        "Top-3-comments": [
            {
                "Comment": "I like this because a lot of the anti-ethtereum FUD tries to split off the L2s and treat them as if they were a separate network. This flathers the Solana metrics.."
            }
        ],
        "comment-sentiment": "Positive"
    },
    {
        "Title": "Daily General Discussion - March 28, 2025",
        "Creation-Time": "2025-03-28 06:01:26",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum.\nhttps:imgur.com3y7vezP(https:imgur.com3y7vezP)  Bookmarking this link will.always bring you to the current daily:  https:old.reddit.comrethereumaboutsticky.?num2(https:old.reddit.comrethereumaboutsticky?num2)   Please use this thread to.discuss Ethereum topics, news, events, and even price!  Price discussion posted.elsewhere in the subreddit will continue to be removed.  As always, be.constructive.  - Subreddit Rules(https:www.reddit.comrethereumaboutrules)  Want.to stake?  Learn more at rethstaker  EthFinance Ethereum Community Links.Ethereum Jobs(https:ethereum.orgencommunityget-involvedethereum-jobs),.Twitter(https:x.comethereum)  EVMavericks.YouTube(https:www.youtube.comevmavericks),.Discord(https:discord.ggevmavericks), Doots.Podcast(https:evmavericks.libsyn.com)  Doots Website(https:dailydoots.com), Old.Reddit Doots Extension(https:github.cometheralphaethfinance-extension) by.uhanniabu  Calendar:   Feb 23 - Mar 2  ETHDenver(https:www.ethdenver.com)  Mar.28-30  ETH Pondy(https:www.ethpondy.xyz) (Puducherry) hackathon  Apr 1-3 EY.Global Blockchain Summit (in person  virtual).",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "ETH Denver",
            "ETH Pondy",
            "EY Global Blockchain Summit"
        ],
        "Suggested-marketing-tags": [
            "Ethereum Community",
            "Blockchain Events",
            "Cryptocurrency Discussion"
        ],
        "Top-3-comments": [
            {
                "Comment-content": "Tricky's Daily Doots 1,068  Yesterday's Daily 27032025  Previous Daily Doots(https:old.reddit.comrethereumcomments1jkx9vxdailygeneraldiscussionmarch272025mk0bbuq)",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment-content": "unod1 covers the Beaconcha.in privacy blunder.(https:old.reddit.comrethereumcomments1jkx9vxdailygeneraldiscussionmarch272025mjzdt0j)",
                "Comment-sentiment": "Negative"
            },
            {
                "Comment-content": "uEmmyRyderling makes the case for Ethereum's network effects making it not replaceable.(https:old.reddit.comrethereumcomments1jkx9vxdailygeneraldiscussionmarch272025mk0bj3d)",
                "Comment-sentiment": "Positive"
            }
        ]
    },
    {
        "Title": "Yesterday in Ethereum, Friday, March 28, 2025",
        "Creation-Time": "2025-03-28 14:43:34",
        "Body": "The US's first bank-issued stablecoin transaction happened on Ethereum(https:custodiabank.compresscustodia-issues-Stablecoin), with custody by Custodia Bank. The US just recently said it's ok for banks to custody stablecoin reserves, as mentioned in a previous Yesterday(https:www.reddit.comrethereumcomm.ents1j6or9zyesterdayinethereumsaturdaymarch82025?). Fidelity Investments reportedly(https:www.ft.comcontent7df7c1d9-9e1f-4de4-8161-1cdb6f4e0e7f) plans to launch a stablecoin too. We previously reported(https:www.reddit.comrethereumcom.ments1jjn6vqyesterdayinethereumtuesdaymarch252025?) they will start recording fund ownership on Ethereum. The Celo blockchain moved to being an Ethereum L2(https:blog.celo.orgcelo-l2-is-now-live-a-note-from-our-.founders-c585bd57b5fa), using the OP Stack and EigenDA. ucoinanon says(https:old.redd.itrethereumcomments1jk52sedailygeneraldiscussionmarch262025mjtsapi). \"It's like how the AOL, Prodigy, and CompuServe centralized networks converted to join the decentralized world wide web.\". Lisk is another blockchain that moved to layer 2. The Solana Virtual Machine has also been launched on Ethereum L2s.(Eclipse, Atlas, SOON, and maybe others I'm forgetting now). The Hoodi testnet successfully forked(https:x.comethPandaOpsstatus1904936019356528989) to Pectra!. That's a relief after problems with the previous two testnets. A tokenized real estate trading platform, RealEstate.Exchange, is launching(https:cointelegraph.comnewstokenized-real-estate-trading-platform-.launches-polygon) on Polygon(https:x.com0xPolygonstatus1904554783584792836) (an Ethereum sidechain which is deploying rollups). \"The REX platform will launch with two luxury property listings in Miami, Florida.\". Trump Media is partnering with centralized exchange Crypto.com's broker dealer Foris Capital to launch ETFs(https:www.globenewswire.comnews-release2025032430483360enTrump-Media-.Announces-Intention-to-Partner-with-Crypto-com-to-Launch-ETFs.html), some of which will invest in crypto. Crypto.com has recently come under fire(https:x.comzachxbtstatus1904399783697031305) for restoring the 70 of their tokens that were supposedly burned in 2021. You can now receive payments at your ENS address (human-readable Ethereum addresses like Vitalik.eth) while keeping them private(https: ens dot domainsblogpostprivate-transactions-with-.fluidkey), using stealth address protocol Fluidkey. unixorokish is now doing monthly summaries of the All Core Devs calls(https:blog.ethereum.org20250325acdcheckpoint-001), where Ethereum development decisions are made. If you want a simple way to follow the protocol upgrades without spending too much time on it, they're good (we'll continue to cover them in a simple way here as well). Christine Kim's summaries(https:www.galaxy.cominsightsresearch) and podcasts(https:www.galaxy.cominsightspodcastsinfinite-jungle) are a popular way to follow development in more detail (though her work has come in(https:old.redd.itrethereumcomments1j0tpkadailygeneraldiscussionmarch012025mfhvi9v) for some criticism(https:old.reddit.comrethereumcomments1ja5dmpdailygeneraldiscussionmarc.h132025mhj38dw), some of which(https:old.reddit.comrethereumcomments1io7devacdc1.50thecompetitiveadvantageofethmcjtubw?context10000) I agree with). Of course, you can also watch the entire calls(https:www.youtube.comEthereumProtocolstreams) and see the \"official\" summaries(https:ethereum-magicians.orgcprotocol-calls63) later (in that forum you'll see there that there are now multiple specialized calls, not just All Core Devs calls). For Fusaka, the fork after Pectra (expected in May), only two EIPs are Scheduled For Inclusion(https:eips.ethereum.orgEIPSeip-7607) now: PeerDAS (increasing blob capacity) and EOF (improving the Ethereum Virtual Machine, which executes the transactions). EOF is getting some pushback for adding complexity, though, so its proponents came up with some simplifying options(https:notes.ethereum.orgipsiloneoffusakaoptions) at the request of Tim Beiko, facilitator of the All-Core-Devs Execution calls. There are only a few more days(https:ethereum-magicians.orgteip-7607-fusaka-meta-eip18439) to share preferences about what to include in Fusaka, and scope freeze is planned for April 10. Execution client Erigon v3.0.0 is out, and it seems like a major upgrade(https:erigon.techreleasing-erigon-v3-0-0), featuring high performance, resource efficiency, and a built-in consensus client, Caplin. Nodes need to run both execution and consensus clients, and this is the first team I'm aware of that's providing both. Abracadabra.Money lost 13 million to an exploit(https:finance.yahoo.comnews13-million-stolen-abracadabra-.money-005501164.html), the second one they've had. Their DAO will reimburse the losses(https:mirror.xyz0x5744b051845B62D6f5B6Db095cc428bCbBBAc6F925X2JijzhkFK6oC.C5oARNuVew5pyGZ1hGbMQ4Qu4kxQ). See the previous(https:www.reddit.comrethereumc.omments1jjn6vqyesterdayinethereumtuesdaymarch252025?) Yesterday in Ethereum.. (Note: This was supposed to go out Wednesday, but was shadow-banned by Reddit. for the ENS link that I've broken up above. DAO forum links have also gotten past Yesterday posts shadow banned. The next Yesterday, catching up through today, will probably be out on Saturday.)",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": [
            "US's first bank-issued stablecoin transaction",
            "Custodia Bank",
            "Fidelity Investments",
            "Celo blockchain moved to Ethereum L2",
            "The Solana Virtual Machine launched on Ethereum L2s",
            "RealEstate.Exchange launching on Polygon",
            "Trump Media partnering with Crypto.com",
            "ENS private transactions",
            "All Core Devs calls",
            "Fusaka fork",
            "Erigon v3.0.0 release",
            "Abracadabra.Money exploit"
        ],
        "Suggested-marketing-tags": [
            "ethereum",
            "stablecoins",
            "blockchain",
            "cryptocurrency",
            "decentralized finance",
            "DAO",
            "ENS",
            "L2",
            "exploits"
        ],
        "Top-3-comments": [
            {
                "comment-body": "These daily reports are awesome.",
                "comment-sentiment": "positive"
            },
            {
                "comment-body": "Thanks for the update!",
                "comment-sentiment": "neutral"
            },
            {
                "comment-body": "Great job on summarizing all these developments!",
                "comment-sentiment": "positive"
            }
        ]
    },
    {
        "Title": "3:28: The Last 24H in Ethereum Core Dev.",
        "Creation-Time": "2025-03-28 17:03:57",
        "Body": "",
        "Sentiment": "",
        "Key-topics-or-keywords": "",
        "Suggested-marketing-tags": "",
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Understand EIPs with Pooja Ranjan  WiEP Cohort 3 Week 6",
        "Creation-Time": "2025-03-28 19:13:56",
        "Body": "Imagine a world where anyone can propose changes to one of the largest blockchain networks and those ideas can reshape the entire ecosystem. Thats how Ethereum evolves: through EIPs. Ethereum Improvement Proposals: History, Documentation, Processes Watch full episode: https:youtu.beWxtcBzv05zM?si-F-RHg0ealA-PIf",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "EIPs",
            "Ethereum",
            "Blockchain",
            "History",
            "Documentation",
            "Processes"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Ethereum",
            "EIPs"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "Highlights of Ethereum's All Core Devs Meeting (ACDE) 208",
        "Creation-Time": "2025-03-28 04:36:21",
        "Body": "The All Core Devs Execution (ACDE) Call 208 centered around the successful activation of the Pectra fork on the Hoodi testnet and the proposed April 30th mainnet deployment. The call also introduced a formal upgrade process framework and assessed the readiness of clients and applications.",
        "Sentiment": "positive",
        "Key-topics-or-keywords": [
            "Ethereum",
            "All Core Devs Meeting",
            "Pectra fork",
            "Hoodi testnet",
            "mainnet deployment",
            "formal upgrade process framework",
            "clients applications"
        ],
        "Suggested-marketing-tags": [
            "Ethereum",
            "blockchain",
            "technology",
            "development",
            "meeting",
            "fork",
            "upgrade",
            "process",
            "framework",
            "readiness",
            "clients",
            "applications"
        ],
        "Top-3-comments": [],
        "comment-sentiment": []
    },
    {
        "Title": "100 gas fees? Is this normal?",
        "Creation-Time": "2025-03-29 05:13:17",
        "Body": "Comments: Try using cowswap. Much better rates. Dont use within wallet swaps. They are expensive. Its probably not really 100 in gas fees - most of that extra cost comes from the app youre using. Also, youre swapping 192M of some token, which looks like a meme coin or low-liquidity token. If the smart contract isnt well optimized - for example: if it performs too many operations or uses inefficient code, then the gas usage goes way up. Thats why these swaps can become very expensive, even if the base gas price on the Ethereum network is normal.",
        "Sentiment": "negative",
        "Key-topics-or-keywords": [
            "gas fees",
            "cryptocurrency",
            "swap",
            "wallet",
            "meme coin",
            "low-liquidity token",
            "smart contract",
            "Ethereum network",
            "cowswap"
        ],
        "Suggested-marketing-tags": [
            "cryptocurrency",
            "gas fees",
            "swap",
            "wallet",
            "meme coins",
            "low-liquidity tokens",
            "smart contract",
            "Ethereum network",
            "cowswap"
        ],
        "Top-3-comments": [
            {
                "Comment": "Try using cowswap. Much better rates. Dont use within wallet swaps. They are expensive.",
                "Comment-sentiment": "positive"
            },
            {
                "Comment": "Its probably not really 100 in gas fees - most of that extra cost comes from the app youre using.",
                "Comment-sentiment": "neutral"
            },
            {
                "Comment": "Also, youre swapping 192M of some token, which looks like a meme coin or low-liquidity token.",
                "Comment-sentiment": "negative"
            }
        ],
        "Subreddit": "ethereum"
    },
    {
        "Title": "Hey rEthereum! Rainbow Wallet team here to answer any questions you have about anything, and also our new Token Launcher. AMA.",
        "Creation-Time": "2025-03-27 16:41:40",
        "Body": "Hey rEthereum! This is your friendly neighborhood Rainbow Wallet team here to answer all your questions about almost anything, especially our new Rainbow Token Launcher, which allows you to create tokens on your favorite L2s in just a few taps. You can then easily airdrop to top Rainbow Farcaster users, your friends via ENS, and suggested Farcaster users based on your social graph. We've made it easy to create tokens for the first time on several L2's and have also set out to turn an historically lonely experience into a fun, social one. We have one (1) question for you: What suggested airdrop lists would you like to see? Thank you to uLogrisTheBard for already helping us identify a way to create a list for OG rEthereum community members: the holder list of the EVMaverick NFTs. Our cofounder Mike (who will be here answering questions) will also be on uJTNichols podcast coming up, so look out for that! Without further ado, AMA.",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Rainbow Wallet",
            "Token Launcher",
            "L2",
            "Airdrop",
            "ENS",
            "Social graph",
            "EVMaverick NFTs",
            "Podcast"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Web3",
            "DeFi",
            "Community",
            "NFTs",
            "Innovation"
        ],
        "Top-3-comments": [
            "It says Just Finished but we'll be answering all questions so please keep them coming if you got em.",
            "what was the first eth coin launched on your platform?",
            "Hey, love the wallet, thanks for making it. Any chance you could add an option to require biometrics just to open the app? Would help with privacy when others (especially kids, who think its a game because of the icon lol) use my phone."
        ],
        "comment-sentiment": [
            "Neutral",
            "Neutral",
            "Neutral"
        ]
    },
    {
        "Title": "Daily General Discussion - March 27, 2025",
        "Creation-Time": "2025-03-27 06:01:09",
        "Body": "Welcome to the Ethereum Daily General Discussion on rethereum. ... Price discussion posted elsewhere in the subreddit will continue to be removed ... As always, be constructive. - Subreddit Rules(https:www.reddit.comrethereumaboutrules) ... ETH Pondy(https:www.ethpondy.xyz) (Puducherry) hackathon ... EY Global Blockchain Summit (in person virtual).",
        "Sentiment": "Neutral",
        "Key-topics-or-keywords": [
            "Ethereum",
            "Daily General Discussion",
            "Price discussion",
            "Subreddit Rules",
            "ETH Pondy",
            "EY Global Blockchain Summit"
        ],
        "Suggested-marketing-tags": [
            "Crypto",
            "Blockchain",
            "Ethereum Community",
            "ETH Pondy",
            "EY Global Blockchain Summit"
        ],
        "Top-3-comments": [
            {
                "Comment-title": "Tricky's Daily Doots 1,067  Yesterday's Daily 26032025  Previous Daily Doots(https:old.reddit.comrethereumcomments1jk52sedailygeneraldiscussionmarch262025mjtwnhg)",
                "Comment-body": "Link to previous daily discussion on Reddit",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment-title": "usuperphiz has some tips for someone who is over-invested.(https:old.reddit.comrethereumcomments1jk52sedailygeneraldiscussionmarch262025mjt70o7)",
                "Comment-body": "Comment discussing investment strategies",
                "Comment-sentiment": "Neutral"
            },
            {
                "Comment-title": "ugrowthepieeth covers an alt L1 bending the knee.(https:old.reddit.comrethereumcomments1jk52sedailygeneraldiscussionmarch262025mjtpu20)",
                "Comment-body": "Comment discussing alternative L1 blockchains",
                "Comment-sentiment": "Neutral"
            }
        ]
    },
    {
        "Title": "Ethereum edges closer to deploying Pectra on mainnet with successful upgrade on Hoodi testnet.",
        "Creation-Time": "2025-03-27 07:33:23",
        "Body": "",
        "Sentiment": "neutral",
        "Key-topics-or-keywords": "Ethereum, Pectra, Hoodi testnet",
        "Suggested-marketing-tags": [
            "Ethereum Upgrade",
            "Blockchain Technology",
            "Cryptocurrency"
        ],
        "Top-3-comments": [
            {
                "Comment": "WARNING ABOUT SCAMS:  Recently there have been a lot of convincing-looking scams posted on crypto-related reddits including fake NFTs, fake credit cards, fake exchanges, fake mixing services, fake airdrops, fake MEV bots, fake ENS sites and scam sites claiming to help you revoke approvals to prevent fake hacks. These are typically upvoted by bots and seen before moderators can remove them. Do not click on these links and always be wary of anything that tries to rush you into sending money or approving contracts. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit(messagecompose?torethereum) if you have any questions or concerns.",
                "Sentiment": "neutral"
            },
            {
                "Comment": "This is just the beginning boys. ETH working on the pecs then will be onto the lats.",
                "Sentiment": "positive"
            },
            {
                "Comment": "Just here to support every development that's coming. Need to see ETH back at 4k.",
                "Sentiment": "positive"
            }
        ],
        "comment-sentiment": [
            "neutral",
            "positive",
            "positive"
        ]
    },
    {
        "Title": "We've just launched our brand new site!",
        "Creation-Time": "2025-04-13 04:34:06",
        "Body": "Hey everyone, we're excited to share that our new website is now live! We've worked hard to make it fast, easy to use, and packed with all the latest features. Check it out and let us know what you think!",
        "Sentiment": "Positive",
        "Key-topics-or-keywords": [
            "web development",
            "new site",
            "features",
            "user experience"
        ],
        "Suggested-marketing-tags": [
            "New Website",
            "Site Launch",
            "Web Development",
            "UX"
        ],
        "Top-3-comments": [
            {
                "Comment-text": "Wow, this site looks great!",
                "comment-sentiment": "Positive"
            },
            {
                "Comment-text": "I can't find the contact form. Help!",
                "comment-sentiment": "Negative"
            },
            {
                "Comment-text": "The site loads quickly, which is fantastic!",
                "comment-sentiment": "Positive"
            }
        ]
    }
]